[{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim was convinced by “Emily from San Francisco” to trade cryptocurrency on her exchange, “100Ex.” Over a few weeks, the victim transferred a little under $2,000 worth of Bitcoin onto the exchange. The victim then received an email representing their account balance as $50,580.59. However, to withdraw the money, the victim would have to pay taxes of 15% on the earnings, which 100Ex calculated to be $7,437.31. The victim was instructed to send the tax payment to 100Ex within 5 days or 100Ex would add a late penalty of 5% of the total daily tax amount.  ","Primary Subject":"100Ex"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim was convinced by “Emily from San Francisco” to trade cryptocurrency on her exchange, “100Ex.” Over a few weeks, the victim transferred a little under $2,000 worth of Bitcoin onto the exchange. The victim then received an email representing their account balance as $50,580.59. However, to withdraw the money, the victim would have to pay taxes of 15% on the earnings, which 100Ex calculated to be $7,437.31. The victim was instructed to send the tax payment to 100Ex within 5 days or 100Ex would add a late penalty of 5% of the total daily tax amount.  ","Primary Subject":"100Ex"},{"Type":"Imposter Scam","Complaint Narrative":"The victim complained that they invested Bitcoin in this company that operates the website https:\/\/247cryptobase.com and lists a phony California address. Now the victim believes the company is a scam and wants a refund.    ","Primary Subject":"247 Crypto Base"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"The victim complained that they invested Bitcoin in this company that operates the website https:\/\/247cryptobase.com and lists a phony California address. Now the victim believes the company is a scam and wants a refund.    ","Primary Subject":"247 Crypto Base"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim complained that they invested Bitcoin in this company that operates the website https:\/\/247cryptobase.com and lists a phony California address. Now the victim believes the company is a scam and wants a refund.    ","Primary Subject":"247 Crypto Base"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"Victim, a single parent with health issues, received a direct message via Instagram from a friend who told her that he had invested $1,000 and got a return of $10,000, and that she could earn money, too, by contacting cherry_thaddeusfx on Instagram. Victim reached out to “Cherry” and told her she was interested in investing. Cherry was very smart and said she mined for bitcoin. She also claimed to be an account manager and told the victim she would give her a high return on her investment. Victim sent $2,000 to purchase Bitcoin and transferred it to Cherry who told her she had set up an account with her trading company, 247tradegrowth.net. At some point, the victim’s account balance showed she had made a profit of $21,800. But when she attempted to cash out, the victim was told that she had to pay a withdrawal fee of $3,650. She then contacted Cherry, who convinced her to invest another $1,000 worth of bitcoin because he had done so well. After a week, her account showed a profit of $45,800. This time, when Cherry told her she needed to pay a withdrawal fee, the victim sent $3,700. She had to borrow the money and followed a list of instructions Cherry sent but was told her withdrawal was pending. She contacted Cherry again, who told the victim to give the “Support Team” access to her Instagram account including back up codes. The victim soon received a message from the Support Team saying she needed to pay more fees, up to $12,400 in order to upgrade her account to comply with SEC regulations as her account balance was so high. She called Cherry and pleaded with her that she needed her money back, but Cherry didn’t reply. At this point, the victim realized this was a scam and reset her Instagram account again. She found out from Instagram that the Support Team twice tried to access her account for more money. Later, she learned that her Driver’s License and Social Security Number had been placed on the dark web. She also learned that the friend who had contacted her about Cherry also had had their account hacked, and so it wasn’t even really her friend who first contacted her.","Primary Subject":"247 Trade Growth 247tradegrowth.net Cherry Thaddeus"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim met someone on an online dating app. At some point, the scammer instructed the victim to send crypto assets to what the victim believed was a legitimate banking app based in Singapore. But the scammer provided fake instructions so that the victim’s money went into the crypto asset wallet belonging to the scammer instead. The victim deposited Ethereum (ETH) into the scammer’s account on three separate occasions, eventually losing thousands of dollars. The victim hired a law firm specializing in crypto assets and was able to locate the scammer’s wallet through blockchain forensic analysis but has not been able to retrieve her funds.","Primary Subject":"88 Trading LLC (Impersonating DBS Banking app)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Two Californians fell victim to the scam website A A16Zcrypto.cc\/H5\/#, which they believed was a legitimate website run by a well-known venture capital firm. The first victim met a woman named “Lena” via LinkedIn. Lena directed the victim to the website A16Zcrypto.cc\/H5\/# where the victim believed he would be able to invest his money into the crypto asset industry. Instead, the money went into the scammer’s wallet account and the victim lost approximately $210,000. The second victim also met someone on LinkedIn, who called herself Cindy Yang aka Daiwei Yang. After a while, Cindy asked to move the conversation to WhatsApp. There, Cindy told the victim that she worked for a cryptocurrency trading company and a venture capital fund that invests in crypto and web3 startups. She told the victim that she and her two partners opened an account on the trading platform, and encouraged the victim to also open an account where Cindy would help him trade. The victim initially invested $2,100 to the scammer’s website with the guidance of the scammer, and he was able to withdraw $500. Convincing him he had made a profit, Cindy asked the victim to put in even more money, and he, after several transactions, had contributed another $68,000. After that, he seldom heard from Cindy again. So, the victim decided to take his money out, which he believed was now worth more than $100,000, with half in his Currency Account and half in his Contract Account, or trading account. However, the website did not return his money, but instead used many excuses to hold his money, such as there was an international Anti-Money laundering Organization investigation or that he needed to pay a penalty first. He sent many messages to the website’s Customer Service but was not able to receive his money. This is not to be confused with the website a16z.com.","Primary Subject":"A16Zcrypto a16z crypto a16zcrypto.cc a16zcrypto.buzz (Entity Impersonating Andreessen Horowitz, a16z.com)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was contacted via Instagram by “Anna” who complimented her about a music video she posted. They struck up a conversation which continued for a few weeks with daily contacts about shared interests - including cryptocurrencies. At one point, “Anna” sent a screenshot of her Forex trading account, which contained a huge amount of money, and offered to help the victim trade, promising she could make enough profit to fund her next album. The victim set up an account with Anna’s guidance, at a broker she recommended. Anna then walked her through a demo trade. The victim made several deposits, totaling approximately $60,000 in both Bitcoin and Ethereum. Anna then convinced her she had made a very successful trade. They stayed in touch, talking about other things, and then one day Anna mentioned they could make even more money by using “referral codes.” She then directed the victim to set up another account in her husband's name to trade at the same time. The victim funded this new account with another $16,000 or so. After that, Anna would let the victim know every other week or so that it was time to trade again, and then tell her she had made another large profit. But the victim noticed she was hearing from Anna less and less. The victim decided to take out some of the profits, but website said it would take 24 hours to process. After waiting the 24 hours, the victim was told she needed “Advancedd Verification” and asked to provide a government ID. The victim waited another 48 hours, then was told it could take two weeks. She waited the two weeks, but her request was rejected. After resubmitting photos of her ID, and waiting another two weeks, the company’s help chat box stopped responding. The victim contacted Anna, but never heard from her again. She then realized her money had been stolen. The company operated the website at https:\/\/ Antrush.com.","Primary Subject":"ANTRUSH ANTEN PTY LTD"},{"Type":"Imposter Scam","Complaint Narrative":"A California Victim reported her friend’s Instagram account got hacked by a bitcoin scammer with the username “Becky Bitcoin”- who convinced her to send $1,000 to make money. The scammer then asked the victim to send more money. The victim refused and asked for her $1,000 back. Becky Bitcoin then asked the victim to change her e-mail address on IG to a new address. The victim became suspicious and realized Becky Bitcoin was probably trying to hack her Instagram account for more victims. The victim also claimed she was scammed into making a Venmo transaction to “Sherry Bellamy”.","Primary Subject":"AnaBrokersTrade Becky Bitcoin Analyst Trader"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Victim met “Margaret Charles” on Facebook who said she could help invest in Bitcoin. “Margaret” directed victim to a trading platform and said she would then see her investment grow, promising profits in seven days. After seven days, Margaret told the victim they had made enough money, and that she should upgrade her account to get a profit in 24 hours. Once the 24 hours passed, Margaret asked the victim to invest even more money to get more profit in the next 24 hours. Then Margaret told the victim she needed to pay a service fee and wait another 24 hours for the profits to be paid out. Next, Margaret told victim she had to pay a tax to a different Bitcoin address. The victim asked for her initial $12,000 investment back plus the $2000 in fees, but Margaret stopped communicating with her. The company operated a website at https:\/\/apexelitetrades.net.  ","Primary Subject":"Apex Elite Trades"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Victim met “Margaret Charles” on Facebook who said she could help invest in Bitcoin. “Margaret” directed victim to a trading platform and said she would then see her investment grow, promising profits in seven days. After seven days, Margaret told the victim they had made enough money, and that she should upgrade her account to get a profit in 24 hours. Once the 24 hours passed, Margaret asked the victim to invest even more money to get more profit in the next 24 hours. Then Margaret told the victim she needed to pay a service fee and wait another 24 hours for the profits to be paid out. Next, Margaret told victim she had to pay a tax to a different Bitcoin address. The victim asked for her initial $12,000 investment back plus the $2000 in fees, but Margaret stopped communicating with her. The company operated a website at https:\/\/apexelitetrades.net.  ","Primary Subject":"Apex Elite Trades"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim met “Annette” online who convinced him to invest in crypto assets, promising high returns. He started sending smaller denominations to the trading platform Annette directed him to and was convinced he had made money. He then put in more money, first $10,000, then $20,000 and each time the platform showed he was making a very high rate of return. Then Annette suggested they could make a lot of money on “transaction nodes.” She then told him they would be guaranteed profits if he “locked in” his money for 21 days. He waited but did not receive any money. Now he can no longer access the website for Asproex.","Primary Subject":"Aspro ex asproex.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Two Californians fell victim to a phone crypto asset exchange, calling itself “BC Group” with an address at bcgmts.vip. The first victim met “Zhou Lin” on Instagram and began trading on bcgmts.vip. At some point, the victim had opened two wallets, one for trade gains which he believed was worth $1.4 million, and one for taxes, which he believes held $350,000. But when he tried to withdraw funds, he was told he needed to pay a “membership fee” first. Then, Zhou Lin offered to help him withdraw the funds, and he ended up giving her another $3,300. After that, he was contacted by numerous individuals offering to help him reclaim the funds and lost another $30,000. All told, the first victim has lost $600,000 to this scam. The second victim met “Anna” via Instagram, who then asked to move the conversation to WhatsApp. After a few weeks Anna started mentioning investing in crypto assets through the platform bcgmts.vip. With some convincing from Anna, the victim decided to invest, little by little. After he had finished a few trades, Anna mentioned she could help him earn even bigger profits. At some point, the victim believed his account was worth $200,000. But in order to withdraw the funds, Anna mentioned he would have to pay taxes, and the platform’s customer service would provide a tax certificate. He thought the tax amount was $40,000, but then things got confusing. First, he was told he needed to pay a $20,000 “member fee” which he did, but then he was told his crypto wallet address had changed and he had to pay another $30,000 to regain access. Then, he paid another $5,000 to reboot the credit score, and a $10,000 fee to authenticate his identity, and another $30,000 because his account was now at high risk and needed to be restored. He began to do research on Romance Scams, and realized he was the victim of a pig-butchering scam. The victim’s total loss is about $150,000.","Primary Subject":"BC Group bcgros.vip bcgmnt.vip bcgmts.vip"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":" ","Primary Subject":"BYBIT"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim reports a fraudulent website promoting a crypto scam promising 718% returns on crypto staking. The promoter of the scam, “Noah Crypto” also posted YouTube videos at https:\/\/www.youtube.com\/watchtv?v=bOAFPE6k25Q.The victim tried to invest, but when he connected his wallet, his 350 SNX tokens disappeared.    ","Primary Subject":"BakerySwap"},{"Type":"High Yield Investment Program","Complaint Narrative":"A California victim reports a fraudulent website promoting a crypto scam promising 718% returns on crypto staking. The promoter of the scam, “Noah Crypto” also posted YouTube videos at https:\/\/www.youtube.com\/watchtv?v=bOAFPE6k25Q.The victim tried to invest, but when he connected his wallet, his 350 SNX tokens disappeared.    ","Primary Subject":"BakerySwap"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"A California victim reports a fraudulent website promoting a crypto scam promising 718% returns on crypto staking. The promoter of the scam, “Noah Crypto” also posted YouTube videos at https:\/\/www.youtube.com\/watchtv?v=bOAFPE6k25Q.The victim tried to invest, but when he connected his wallet, his 350 SNX tokens disappeared.    ","Primary Subject":"BakerySwap"},{"Type":"Asset Recovery Scam","Complaint Narrative":"A Californian victim downloaded the BitFunds app on his phone via the Google Play Store. BitFunds purportedly allowed users to invest in what it advertised as “cloud mining”. Investors were promised a share of miners' profits or mined bitcoin. BitFunds also claimed that the more money you invested, the faster you would accumulate a portion of the mined bitcoin. The victim, having paid $200, never received the promised services and did not get any of his money back. Subsequently, the app's name was changed, and it failed to respond to the victim's inquiries. “Bitfunds” appears to have been running a scam through its app.  ","Primary Subject":"BitFunds"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"A Californian victim downloaded the BitFunds app on his phone via the Google Play Store. BitFunds purportedly allowed users to invest in what it advertised as “cloud mining”. Investors were promised a share of miners' profits or mined bitcoin. BitFunds also claimed that the more money you invested, the faster you would accumulate a portion of the mined bitcoin. The victim, having paid $200, never received the promised services and did not get any of his money back. Subsequently, the app's name was changed, and it failed to respond to the victim's inquiries. “Bitfunds” appears to have been running a scam through its app.  ","Primary Subject":"BitFunds"},{"Type":"Advance Fee Scam","Complaint Narrative":"Two Californians fell victim to a scam run through the app “Bitcoin Bonus.” The first victim received an e-mail stating that she had signed up for a free Bitcoin mining site. The victim watched the account grow for about a year, and believed at one point, she had $32,000 waiting to be claimed. Then the victim received a message saying she had 24 hours to claim the money, or the account would be deleted. The victim attempted to follow the steps on the site to release the funds, but it asked her to provide a wallet address or cash card number and said there would be a $64.00 upfront fee to withdraw. The victim reported communicating through the online chat function of the app, with an account manager named “Amelia”. The second victim provided screenshots from his phone that showed him communicating though online chat. One shot showed the victim had BTC waiting for him in his account. Another screen shot showed his “payout” was $36,391.48 and that he needed to withdraw the money within 24 hours. It also instructed him to use an “express account” so as not to pay Federal Income Tax, which it claimed would be 15% of the profit. When the victim tried to withdraw, he was told his payout would be broken into two installments, and he would have to pay commissions. The screenshot also showed communications from what appeared to be other customers encouraging the victim to pay the commissions, explaining that after they did, they got their money released. But the second victim, despite paying commissions, did not receive any money.","Primary Subject":"Bitcoin Bonus pro-btmining.site MineSlot.site RedParNet.site"},{"Type":"Identity Theft","Complaint Narrative":"A California victim recounts an email phishing scam related to a crypto asset website they used. The victim received an email from Google Sheets stating it had been almost a year since they had last been active on the “Bitcoin Mining” website and therefore, they were closing the victim's account. But, the email continued, if the victim wanted to claim their crypto assets from the account, they would need to cash out in the next 24 hours. The victim clicked on a link in the email, which took them to the Bitcoin Mining website where they were asked for personal information, an account number to transfer the crypto assets to, and a $64 fee. The victim complied, and paid the fee, then got an error message. The original link in the email was also no longer active. The victim has not been able to recover the $64 and feels vulnerable after disclosing personal information to a scam.","Primary Subject":"Bitcoin Mining svcoin.space my-minings.top"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim filed a complaint with DFPI about the crypto asset exchange, bitcoinvestcloud.com. The victim was contacted by a customer service representative named “Mindy” through WhatsApp and was directed to invest funds in the exchange. He used crypto.com to send funds to a “Trust Wallet.” When he made attempts to withdraw his funds, he was requested to pay additional fees as prerequisites to the withdrawals.","Primary Subject":"Bitcoin Vest Cloud bitcoinvestcloud.com Cryptovestcloud"},{"Type":"Advance Fee Scam","Complaint Narrative":"A California victim reports their experience with a website called bitcoin-win.com. For about a month, the victim traded crypto assets on the website and was able to make both deposits and withdrawals of some funds. The victim increased their investment and placed larger trades. The victim shared emails from “Bitcoinwin” which showed what happened next:  Hello! After bitcoin-win exchange review, because of the first large withdrawal of coins from your personal account, the exchange in order to ensure the safety of the user's personal account funds, you need to complete the following three points within 7 working days: 1、Submit your personal handheld document selfie 2、Submit your personal bank statement for the past three months 3. You must pay a withdrawal deposit of $2221.2192 (15% of your total market value of $14,808.13), which will be deposited in your personal account assets (the withdrawal deposit paid belongs to you). After completion, bitcoin-win exchange will re-evaluate your personal account and complete the withdrawal request. Please be informed! Enjoy your life! Hello! After review by the exchange, you have completed the deposit of your personal account, the first level of assessment and audit has been passed, your personal account in this exchange to withdraw coins, withdrawal application is under review, according to the tax policy of the U.S. region and uniform fulfillment guidelines for all users, you need to pay 12% tax of the total market value of your personal account within 7 days to pay short-term capital gains tax, please contact the online service to get the payment address and complete the payment. After the payment is completed, the withdrawal request will be automatically reviewed and the withdrawal funds will be sent to your withdrawal wallet address, please be informed! Wish you a happy life! Hello! After our exchange review, your account now needs to pay a tax, you need to pay extra, the exchange is unable to deduct your tax through withdrawals, please pay the 12% short-term capital gains tax within the specified time, after successful payment send us proof of successful payment, after completion of your withdrawal will automatically pass, thank you for your cooperation! Have a nice life! After the exchange audit, you have completed the payment of your personal taxes, and the tax audit has passed. Due to the fact that your personal account has been operating transactions on the exchange for a long time and has never paid quarterly custody fees, your withdrawal of coins has not passed. It is being re-audited. According to the Exchange's requirements to the Financial Supervisory Authority, you need to pay a quarterly custody fee of 10% of the total liquidity of your personal account. After the payment is completed, the withdrawal request will be automatically reviewed, and the withdrawal funds will be automatically sent to your withdrawal wallet address. Please be informed! Enjoy your life! As a result of the exchange's review of your personal account, your personal account is suspected of money laundering, because the funds paid into your personal account have been transferred to your personal assets by a wallet address that does not match your identity verification for several times. The total amount of funds transferred to your personal assets is 1000 USDT, so that your personal account will be unfrozen, and the Exchange will review and complete the withdrawal for you! Have a nice life! Hello, you still have the last one not completed, please pay the corresponding deposit as required, it will be automatically audited after completion, and the withdrawal will automatically reach your withdrawal address after passing, thank you and wish you a happy life. Hello! We have received your funds, we will re-examine your account, after passing your withdrawal will be automatically passed and sent to your address, the results will be sent to you via email within 24 hours, please be informed! Have a nice life! Hello! We have detected that when we unfrozen your account last time, we did not unfreeze your account within 7 days as stipulated by the exchange, which has been seriously overdue. Now your account is still in the process of illegal operation, and you need to pay $800 overdue management fee to unfreeze your funds. Please note that! Wish you a happy life!","Primary Subject":"Bitcoin-win.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim reports their experience with a website called bitcoin-win.com. For about a month, the victim traded crypto assets on the website and was able to make both deposits and withdrawals of some funds. The victim increased their investment and placed larger trades. The victim shared emails from “Bitcoinwin” which showed what happened next:  Hello! After bitcoin-win exchange review, because of the first large withdrawal of coins from your personal account, the exchange in order to ensure the safety of the user's personal account funds, you need to complete the following three points within 7 working days: 1、Submit your personal handheld document selfie 2、Submit your personal bank statement for the past three months 3. You must pay a withdrawal deposit of $2221.2192 (15% of your total market value of $14,808.13), which will be deposited in your personal account assets (the withdrawal deposit paid belongs to you). After completion, bitcoin-win exchange will re-evaluate your personal account and complete the withdrawal request. Please be informed! Enjoy your life! Hello! After review by the exchange, you have completed the deposit of your personal account, the first level of assessment and audit has been passed, your personal account in this exchange to withdraw coins, withdrawal application is under review, according to the tax policy of the U.S. region and uniform fulfillment guidelines for all users, you need to pay 12% tax of the total market value of your personal account within 7 days to pay short-term capital gains tax, please contact the online service to get the payment address and complete the payment. After the payment is completed, the withdrawal request will be automatically reviewed and the withdrawal funds will be sent to your withdrawal wallet address, please be informed! Wish you a happy life! Hello! After our exchange review, your account now needs to pay a tax, you need to pay extra, the exchange is unable to deduct your tax through withdrawals, please pay the 12% short-term capital gains tax within the specified time, after successful payment send us proof of successful payment, after completion of your withdrawal will automatically pass, thank you for your cooperation! Have a nice life! After the exchange audit, you have completed the payment of your personal taxes, and the tax audit has passed. Due to the fact that your personal account has been operating transactions on the exchange for a long time and has never paid quarterly custody fees, your withdrawal of coins has not passed. It is being re-audited. According to the Exchange's requirements to the Financial Supervisory Authority, you need to pay a quarterly custody fee of 10% of the total liquidity of your personal account. After the payment is completed, the withdrawal request will be automatically reviewed, and the withdrawal funds will be automatically sent to your withdrawal wallet address. Please be informed! Enjoy your life! As a result of the exchange's review of your personal account, your personal account is suspected of money laundering, because the funds paid into your personal account have been transferred to your personal assets by a wallet address that does not match your identity verification for several times. The total amount of funds transferred to your personal assets is 1000 USDT, so that your personal account will be unfrozen, and the Exchange will review and complete the withdrawal for you! Have a nice life! Hello, you still have the last one not completed, please pay the corresponding deposit as required, it will be automatically audited after completion, and the withdrawal will automatically reach your withdrawal address after passing, thank you and wish you a happy life. Hello! We have received your funds, we will re-examine your account, after passing your withdrawal will be automatically passed and sent to your address, the results will be sent to you via email within 24 hours, please be informed! Have a nice life! Hello! We have detected that when we unfrozen your account last time, we did not unfreeze your account within 7 days as stipulated by the exchange, which has been seriously overdue. Now your account is still in the process of illegal operation, and you need to pay $800 overdue management fee to unfreeze your funds. Please note that! Wish you a happy life!","Primary Subject":"Bitcoin-win.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A Californian reports that he was contacted via direct message on Instagram by a stranger calling himself “Donald Henry,” who claimed to be a crypto investor. While the victim was initially wary of investing with someone he did not know, “Donald” spent months convincing the victim that he could mirror “Donald’s” trading success using the same AI software “Donald” did.","Primary Subject":"Bitglobal Bit Global Options bitglobaloptn.com bitglobaloptions.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim received a notification on Instagram that “Rembrandt Flores” was requesting to follow her. She thought the request was from somebody she knew. Rembrandt sent her a message saying hi and asking to talk about her day. At some point, Rembrandt asked to move the conversation over to WhatsApp, and there, mentioned cryptocurrency trading, telling the victim he could show her how to invest. He directed her to a website, bitstackoption.com. The victim told Rembrandt she didn’t know anything about cryptocurrency, so he directed her to the crypto.com app, and showed her how to open a wallet. He asked how much she had in the bank, which she indicated was not much. He said that was okay, and in fact, he would add $1,000 to whatever she wanted to invest, because that was not much money to him. She invested $2,000 and Rembrandt represented that he added $1,000, and he subsequently told the victim her account was worth more than $14,000. The victim told her mother, who invested $4,000 and was told her balance was more than $28,000. This is not to be confused with the company Bitstack which operates the website at www.bitstrack-app.com.  The victim subsequently told Rembrandt she and her mother wanted to withdraw their money from their accounts. But they were told by the website they would need to pay fees upfront, and they could not deduct the fees from the withdrawal amount. So, the victim went to a Bitcoin ATM and paid the fees of more than $8,000 for her and more than $5,500 for her mom. After hearing nothing, the victim’s mom messaged Rembrandt on WhatsApp. The real Rembrandt responded saying he had no idea what she was talking about. At that point, the victim realized someone was pretending to be her friend and that she had been scammed. The company operated the website at https:\/\/bitstackoption.com.  At some point, the victim told Rembrandt she and her mother wanted to withdraw their money from their Bitstack accounts. But they were told by Bitstack they would need to pay fees upfront, and they couldn’t deduct the fees from the withdrawal amount. So the victim went to a Bitcoin ATM and paid the fees, more than $8,000 for her, and more than $5,500 for he mom. After hearing nothing, the victim’s mom messaged Rembrandt on her own WhatsApp. The real Rembrandt responded saying he had no idea what she was talking about. At that point, the victim realized someone was pretending to be her friend and that she had been scammed.","Primary Subject":"Bitstack Option"},{"Type":"Imposter Scam","Complaint Narrative":"The victim received a notification on Instagram that “Rembrandt Flores” was requesting to follow her. She thought the request was from somebody she knew. Rembrandt sent her a message saying hi and asking to talk about her day. At some point, Rembrandt asked to move the conversation over to WhatsApp, and there, mentioned cryptocurrency trading, telling the victim he could show her how to invest. He directed her to a website, bitstackoption.com. The victim told Rembrandt she didn’t know anything about cryptocurrency, so he directed her to the crypto.com app, and showed her how to open a wallet. He asked how much she had in the bank, which she indicated was not much. He said that was okay, and in fact, he would add $1,000 to whatever she wanted to invest, because that was not much money to him. She invested $2,000 and Rembrandt represented that he added $1,000, and he subsequently told the victim her account was worth more than $14,000. The victim told her mother, who invested $4,000 and was told her balance was more than $28,000. This is not to be confused with the company Bitstack which operates the website at www.bitstrack-app.com.  The victim subsequently told Rembrandt she and her mother wanted to withdraw their money from their accounts. But they were told by the website they would need to pay fees upfront, and they could not deduct the fees from the withdrawal amount. So, the victim went to a Bitcoin ATM and paid the fees of more than $8,000 for her and more than $5,500 for her mom. After hearing nothing, the victim’s mom messaged Rembrandt on WhatsApp. The real Rembrandt responded saying he had no idea what she was talking about. At that point, the victim realized someone was pretending to be her friend and that she had been scammed. The company operated the website at https:\/\/bitstackoption.com.  At some point, the victim told Rembrandt she and her mother wanted to withdraw their money from their Bitstack accounts. But they were told by Bitstack they would need to pay fees upfront, and they couldn’t deduct the fees from the withdrawal amount. So the victim went to a Bitcoin ATM and paid the fees, more than $8,000 for her, and more than $5,500 for he mom. After hearing nothing, the victim’s mom messaged Rembrandt on her own WhatsApp. The real Rembrandt responded saying he had no idea what she was talking about. At that point, the victim realized someone was pretending to be her friend and that she had been scammed.","Primary Subject":"Bitstack Option"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim received a notification on Instagram that “Rembrandt Flores” was requesting to follow her. She thought the request was from somebody she knew. Rembrandt sent her a message saying hi and asking to talk about her day. At some point, Rembrandt asked to move the conversation over to WhatsApp, and there, mentioned cryptocurrency trading, telling the victim he could show her how to invest. He directed her to a website, bitstackoption.com. The victim told Rembrandt she didn’t know anything about cryptocurrency, so he directed her to the crypto.com app, and showed her how to open a wallet. He asked how much she had in the bank, which she indicated was not much. He said that was okay, and in fact, he would add $1,000 to whatever she wanted to invest, because that was not much money to him. She invested $2,000 and Rembrandt represented that he added $1,000, and he subsequently told the victim her account was worth more than $14,000. The victim told her mother, who invested $4,000 and was told her balance was more than $28,000. This is not to be confused with the company Bitstack which operates the website at www.bitstrack-app.com.  The victim subsequently told Rembrandt she and her mother wanted to withdraw their money from their accounts. But they were told by the website they would need to pay fees upfront, and they could not deduct the fees from the withdrawal amount. So, the victim went to a Bitcoin ATM and paid the fees of more than $8,000 for her and more than $5,500 for her mom. After hearing nothing, the victim’s mom messaged Rembrandt on WhatsApp. The real Rembrandt responded saying he had no idea what she was talking about. At that point, the victim realized someone was pretending to be her friend and that she had been scammed. The company operated the website at https:\/\/bitstackoption.com.  At some point, the victim told Rembrandt she and her mother wanted to withdraw their money from their Bitstack accounts. But they were told by Bitstack they would need to pay fees upfront, and they couldn’t deduct the fees from the withdrawal amount. So the victim went to a Bitcoin ATM and paid the fees, more than $8,000 for her, and more than $5,500 for he mom. After hearing nothing, the victim’s mom messaged Rembrandt on her own WhatsApp. The real Rembrandt responded saying he had no idea what she was talking about. At that point, the victim realized someone was pretending to be her friend and that she had been scammed.","Primary Subject":"Bitstack Option"},{"Type":"Imposter Scam","Complaint Narrative":"The victim met “Mingyi,” who convinced her to invest in bitcoin, promising she would make money. Mingyi convinced the victim to transfer money from Cryptal.com to a fake platform at https:\/\/www.bitstampnd.info\/#\/. When the victim wanted to withdraw her money from the fake platform, she received a message saying her investment had grown to more than $300,000 but the tax department at the company said she needed to pay 35% income tax or more than $90,000 to withdraw the money, and the tax could not be deducted from the account assets. The company demanded that she complete the payment of the taxes within three business days after the notice, and that the victim must provide her social security number or personal tax identification number to complete the transaction. The victim said she lost all her savings to this scam. The company operated the website at https:\/\/bitstampnd.info\/#\/. This is not to be confused the website www.bitstamp.net.","Primary Subject":"Bitstampnd.info (Impersonating Bitstamp)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California resident complaint about the websites https:\/\/www.bityardpro.com and www. bityardit.com which they used as a platform to trade crypto assets. After believing they had profited from successful trades through the website, the victim attempted to withdrawal their assets, which they thought was approximately $700,000. The victim then heard from the website that they needed to pay taxes first which amounted to 30% of the profits, or approximately $162,822. The website informed the victim that it would not allow the withdrawal until they paid. The company also stated that they are collecting taxes for the IRS, which is not true. The victim was unable to recover their assets and the website is no longer operational.","Primary Subject":"Bityard bityardpro.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A Californian claims to have lost more than $9,200 to scammers after responding to a text message from stranger named “Lilly” who then struck up a conversation. The conversation deepened and Lilly asked that they communicate on WhatsApp and then on the Telegram instant messaging platform, where she used the handle “@Lily666666.” Eventually, “Lilly” convinced the victim she was romantically interested, and also began to discuss investing in crypto assets. Lilly steered the victim to the website www.cmecoinvip.com and showed him how to transfer $9,4000 into stablecoin, which they would then transfer to website to trade “gold futures”, and later showed him that the trades had generated more than $3,000 in profit very quickly.","Primary Subject":"CME Coin VIP cmecoinvip.com fileserverj.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was communicating with “Mr. Colin Rusch” and “Ms. Anne” in a WhasApp group that claimed to be investors in the cryptocurrency Bitcoin and Ethereum. The group connected the victim to the website coinftx.io, which they claimed was an international crypto market. The group offered to show her an investing plan where they tell everyone when to buy crypto and when they had made money. After a while. “Ms. Anne” asked to increase the amount of capital she had invested to make even more money. After 2 or 3 months the victim had invested more than $50,000, and believed her account was worth approximately $200,000, but when she tried to withdraw her money she was unable to. The company operated the website at https:\/\/coinftx.io.","Primary Subject":"Coin FTX (Entity Impersonating FTX)"},{"Type":"Hacking","Complaint Narrative":"A California victim reports a crypto asset scam that began after one of the victim's friend’s Instagram accounts was hacked. Unaware of the hack, the victim saw on Instagram that their friend had made a lot of money from someone named “Adriana Montez” who claimed to be making lots of money by investing in crypto assets. Adriana reached out to the victim and asked them to contact her. Thinking this was someone that the victim's friend knew, the victim contacted Adriana, who explained that she made money by investing in crypto assets through a platform that generated 10 times the capital in profits, and that she could cash out every day. Adriana continued to send text message via Telegram and eventually convinced the victim to send $2,000 via Zelle. Next, Adriana instructed the victim how to register and open an account on www.coinproxyus.com. Adriana uploaded a screenshot of the $2,000 that was supposedly deposited there and showed the victim their profits were increasing on the platform. Adriana encouraged the victim to cash out $100, the daily limit, which really showed up in his bank account. Adriana said that proved the account was fluid, that the platform worked, and that the victim would be able to get their money back. Adriana told the victim his account was only at the “Basic” level, and that if the victim upgraded to the “Bronze” level they would have access to unlimited withdrawals, just like their friend had done. Still unaware of the hack, the victim contacted their friend on Instagram who confirmed the process and stated that the victim would be so happy with all that money and not worry about anything. The victim asked their friend to give him a call, but the victim's friend replied that they were busy. Soon after, the victim's “friend” contacted them on Instagram and said he got a new phone number. Soon, Adriana contacted the victim and told him to transfer $3,000 onto the platform to qualify for the “Bronze” level. But when they did that, Adriana said they misunderstood and it was supposed to be $5,000. The victim asked Adriana if they could start taking out some of their profits, but she encouraged the victim to wait until the profits reached $20,000. The victim decided to try to take some of the daily $100 withdrawals to reduce the victim's balance, but this time they were unsuccessful. The victim then asked Adriana why they couldn’t withdraw the daily limit, and she told them the pay outs would only disturb the trades, so they had to be patient and wait until they reached their goal of $20,000 to cash out. The next morning Adriana told the victim their account balance had reached $20,689 and they could now withdraw their funds. But when the victim tried to do so, they received an email from the platform saying they needed to file a trading certificate and provide personal information. The victim reached out to Adriana to ask how to get their money back without providing their personal information but she never responded. The victim later found out their friend’s Instagram account had been hacked and that it was a scam. The website is no longer operational.","Primary Subject":"Coin Pro X US coinproxus.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim, a new mom, saw a person on Tik Tok discussing passive income opportunities, and sent a message to her. The woman on Tik Tok messaged her back and they continued to communicate via WhatsApp. The woman on Tik Tok told her about a website called Cointrade Mining and sent the victim screenshots on how to open an account on the site. The woman on Tik Tok told the victim to download an App called Strike and deposit money on it by following a QR code. The victim did, but the app showed her balance was zero. The woman on Tik Tok told the victim to use Cash App instead, so the victim sent more money. Then the woman on Tik Tok gave the victim a Bitcoin address to send the money to, telling the victim to invest big and earn big money. But then the Bitcoin went to zero as well. So the woman on Tik Tok told her to go the nearest Bitcoin ATM and deposit money there, following the screenshots provided. The woman on Tik Tok then told the victim her that her investment on the Cointrade Mining website was worth more than $28,000. But when she tried to withdraw the money from the platform, an Account Manager named “Frank” told her she had to pay maintenance fees and taxes before she could withdraw her money. After that, more “Account Managers” told her she needed to deposit more money to get her money out. The company operated the website at https:\/\/www.cointrademining.com.    ","Primary Subject":"Coin Trade Mining"},{"Type":"High Yield Investment Program","Complaint Narrative":"The victim, a new mom, saw a person on Tik Tok discussing passive income opportunities, and sent a message to her. The woman on Tik Tok messaged her back and they continued to communicate via WhatsApp. The woman on Tik Tok told her about a website called Cointrade Mining and sent the victim screenshots on how to open an account on the site. The woman on Tik Tok told the victim to download an App called Strike and deposit money on it by following a QR code. The victim did, but the app showed her balance was zero. The woman on Tik Tok told the victim to use Cash App instead, so the victim sent more money. Then the woman on Tik Tok gave the victim a Bitcoin address to send the money to, telling the victim to invest big and earn big money. But then the Bitcoin went to zero as well. So the woman on Tik Tok told her to go the nearest Bitcoin ATM and deposit money there, following the screenshots provided. The woman on Tik Tok then told the victim her that her investment on the Cointrade Mining website was worth more than $28,000. But when she tried to withdraw the money from the platform, an Account Manager named “Frank” told her she had to pay maintenance fees and taxes before she could withdraw her money. After that, more “Account Managers” told her she needed to deposit more money to get her money out. The company operated the website at https:\/\/www.cointrademining.com.    ","Primary Subject":"Coin Trade Mining"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim, a new mom, saw a person on Tik Tok discussing passive income opportunities, and sent a message to her. The woman on Tik Tok messaged her back and they continued to communicate via WhatsApp. The woman on Tik Tok told her about a website called Cointrade Mining and sent the victim screenshots on how to open an account on the site. The woman on Tik Tok told the victim to download an App called Strike and deposit money on it by following a QR code. The victim did, but the app showed her balance was zero. The woman on Tik Tok told the victim to use Cash App instead, so the victim sent more money. Then the woman on Tik Tok gave the victim a Bitcoin address to send the money to, telling the victim to invest big and earn big money. But then the Bitcoin went to zero as well. So the woman on Tik Tok told her to go the nearest Bitcoin ATM and deposit money there, following the screenshots provided. The woman on Tik Tok then told the victim her that her investment on the Cointrade Mining website was worth more than $28,000. But when she tried to withdraw the money from the platform, an Account Manager named “Frank” told her she had to pay maintenance fees and taxes before she could withdraw her money. After that, more “Account Managers” told her she needed to deposit more money to get her money out. The company operated the website at https:\/\/www.cointrademining.com.    ","Primary Subject":"Coin Trade Mining"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim opened an account at what he believed was a legitimate crypto exchange platform, but instead dealt with a platform using a similar name, coinlistro.com. Victim believed he was day-trading on that platform and eventually the website showed he had a balance of more than $95,000. At that point, he asked to withdraw his funds through the customer service portal. He received a message saying he needed to pay a 10% withdrawal fee within 7 days. The victim sent approximately $9,000 to the platform. He then received an email thanking him for paying the fees, but that he now needed to pay capital gains taxes of 38% to the IRS, but they would agree to pay 8% of that. The victim went back and forth a few times about why he couldn’t pay the taxes to the IRS directly, and eventually decided not to pay the money. Then the company sent another email saying it withdrew its offer to pay 8% and that he needed to send the full 38% for taxes, plus another $4,000 late fee within 10 days, and that he needed to provide: a Photo ID; a Social Security or tax ID number; and his tax returns for last year or any previous year. The email went on to say that if the victim failed to pay taxes within 10 days, his account assets would be permanently frozen, and he would face penalties including criminal charges and that he could face five years in prison, and a fine of up to $250,000. The company operated the websites at https:\/\/m.coinlist.vip\/home and https:\/\/m.coinlistro.com. This is not to be confused with the company CoinList Pro which operates a website at coinlist.co.","Primary Subject":"CoinList Ro (Entity Impersonating CoinList Pro)"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"Two separate victims reported meeting a person on dating app “Coffee Meets Bagel,” who then asked to move the chat to WhatsApp, where the victims believed they were beginning a relationship. The scammer claimed to be rich and could teach each victim how to trade cryptocurrency. Both victims sent money to this person to purchase cryptocurrency and were told the money would be invested in CoinMicro. Victim #1 gave $30,000, and then continued to give money. At some point, victim #1 tried to withdraw the money, but was told they needed to pay a 15% tax upfront to withdraw the funds. Victim #2 invested more than $200,000 and only learned it was a scam from a friend. The company operated a website at https:\/\/www.coinmicro.org.  ","Primary Subject":"CoinMicro.org"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Two separate victims reported meeting a person on dating app “Coffee Meets Bagel,” who then asked to move the chat to WhatsApp, where the victims believed they were beginning a relationship. The scammer claimed to be rich and could teach each victim how to trade cryptocurrency. Both victims sent money to this person to purchase cryptocurrency and were told the money would be invested in CoinMicro. Victim #1 gave $30,000, and then continued to give money. At some point, victim #1 tried to withdraw the money, but was told they needed to pay a 15% tax upfront to withdraw the funds. Victim #2 invested more than $200,000 and only learned it was a scam from a friend. The company operated a website at https:\/\/www.coinmicro.org.  ","Primary Subject":"CoinMicro.org"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim joined a digital exchange called Coinwpro.xyz and started investing, staking and mining there after the exchange promised he could make 2% daily. After the company represented his account was worth approximately $370,000 he requested a withdrawal. He was able to make several withdrawals of smaller amounts, but when he asked to withdraw more the company told him he needed to pay more than $100,000 for taxes, or he couldn’t withdraw any more. He didn’t pay, but tried to withdraw a smaller amount again and got no response. He sent the company a message on WhatsApp asking about his withdrawals and was told he needed to pay an electricity fee of more than $25,000 or he wouldn’t be able to withdraw any more money. The company operated a website at https:\/\/www.CoinWpro.xyz.  ","Primary Subject":"CoinWpro"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"The victim joined a digital exchange called Coinwpro.xyz and started investing, staking and mining there after the exchange promised he could make 2% daily. After the company represented his account was worth approximately $370,000 he requested a withdrawal. He was able to make several withdrawals of smaller amounts, but when he asked to withdraw more the company told him he needed to pay more than $100,000 for taxes, or he couldn’t withdraw any more. He didn’t pay, but tried to withdraw a smaller amount again and got no response. He sent the company a message on WhatsApp asking about his withdrawals and was told he needed to pay an electricity fee of more than $25,000 or he wouldn’t be able to withdraw any more money. The company operated a website at https:\/\/www.CoinWpro.xyz.  ","Primary Subject":"CoinWpro"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met a person on WeChat who convinced her to invest in cryptocurrency mining. Victim followed scammer’s instructions to transfer $12,000 to a cryptocurrency exchange, and then to the site coinbase.iii36.vip to begin mining. Victim tried to withdraw money from her account but was told she needed to wait 24 hours. Soon after, she got notice that all her cryptocurrency had been transferred out of her crypto wallet. The company operated a website at","Primary Subject":"Coinbase.ii36vip (Entity impersonating Coinbase)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was involved in a scam where she lost $87,000.00. She began communicating with a group of “friends” through text message, who then connected her to a telegram group. Over the telegram group, the “friends” texted each other for almost a month just to have conversations about world events. At some point, one of the friends shifted the conversation to stock and market conditions. The friend showed the group her investments in crypto with screenshots and a website they could use to trade Bitcoin. She showed them how to set up an account at the website https:\/\/coindcx.win wherein they could create an account and learn how to trade without using real money. During this period, the “friend” told the victim she was making a consistent profit of 20% on her trial investments and encouraged her to put in real money. She was able to withdraw small amounts and began to put in more money, approximately $87,000 in total. When the website showed her account balance $299,000, the victim tried to withdraw the money. Instead, she was told that her account was frozen, and she would have to deposit the additional funds to unfreeze it and withdraw any money. The company operated the websites at https:\/\/coindcx.win. This is not to be confused with the website https:\/\/coindcx.com.","Primary Subject":"Coindcx.win (Entity Impersonating CoinDCX)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim, a U.S. military veteran, met a “Mary” on the social media app WhatsApp who introduced the victim to an investment platform called “Coinegg” at a website called “ceggcc.vip.\" Mary worked for weeks to build trust with the victim, inviting the victim to switch from conversing with her “business account” to her “private account.” Then, Mary invited the victim to join Mary’s “friends and family account” on a different social media app called Telegram. There, Mary persuaded the victim to invest with her through Coinegg. Mary presented Coinegg as a means of earning a stable income through investments.","Primary Subject":"Coinegg ceggcc.vip"},{"Type":"Pig Butchering Scam","Complaint Narrative":"At least three Californians and one non-Californian report they lost money to scammers utilizing the website http:\/\/coinrus.com\/. (continued from previous row)","Primary Subject":"Coinrus.com (Entity impersonating Korean Crypto Exchange Coinone.co.kr)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim opened an account on this website after being referred by a friend “Lisa.” She was subsequently contacted by “Roman” who, communicating through Line Chat, told the victim he was an expert in economics, and could teach her step by step how to make money. During the next few weeks Roman convinced her to put in as much money as she could, including borrowing money from friends or taking out a loan if necessary. Eventually, the victim invested her life savings of more than $500,000 - including her IRA and retirement- through the website. At one point, her account showed a balance of more than $1.2 million. But then the victim was unable to log in to her account. She received a message from customer service saying her account was frozen, and she needed to deposit 30% of her account balance (more than $380,000) into her account within 30 days or she would never be able to get her money back. The victim was then notified that her identify had been stolen, and her phone number and gmail account had been transferred to another individual. She heard from her bank that a person was trying to wire money out of her bank account into a cryptocurrency exchange. Eventually, the victim was able to recover her phone number and gmail account and log back into her account, but she was told her money was still frozen and she only had 20 days to deposit the $300,000 or she would lose her money. The company operated the websites at coinworldage.com and coinworldlin.com.","Primary Subject":"Coinworldage.com Coinworldlin.com (Entity Impersonating Coin World)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A Californian reports he fell victim to a crypto scam after a friend urged him to invest money in a Bitcoin mining company, “Crystal Linkz FX.” Less than two hours after making his initial investment of $950, the victim’s account balance appeared to quintuple, showing a $5,000 profit. When he attempted to invest further funds, the victim was told that he would need to upgrade his account, for $2,000. Victim paid the “upgrade” fee, and received confirmation of the upgrade via email, but then was told he now needed to pay another $2,700 for a “Trading and Mining Validation Pin.” Two weeks after the “Validation Pin” issue was resolved, the Victim was told he needed $3,750 for a “Broker Permit” and a “Withdrawal Permit.” Since his crypto account supposedly held $24,500 in profit at the time, Victim paid the amount and was assured he would be able to withdraw from that account without any further fees. However, when he again tried to initiate a withdrawal, he was redirected to a customer service agent who tried to assess another $3,250 upgrade fee before he could complete the withdrawal. When the victim declined to pay the fee, the company harassed him for months, until he demanded that they close his account and return his total deposit amount. To date, the victim has not received any money back and the website has been taken down.","Primary Subject":"Crystal Linkz FX Crystal Linkz FX Link Zen crystallinkzen.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim transferred more than $1,400,000 from Coinbase to an app-based cryptocurrency trading platform. Victim was able to withdraw more than $45,000. Victim then executed multiple trades through that platform and believed approximately $8-9 million was in the account. But when the victim asked the platform to move the funds back to Coinbase, he was told that the funds were frozen, and that he needed to deposit approximately $600,000 as “verification” that the funds were not laundered. Victim has not been able to withdrawal any more funds and now believes that the platform is a fraud. The company operated a website at https:\/\/www. dcex-exchange.com. ","Primary Subject":"DCEX Exchange"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim believed he was depositing funds in a cryptocurrency exchange on website dahuatop.com. This cryptocurrency exchange has also appeared on uobvip.com and dahuagvip.com. The victim joined the exchange through a representative named ‘Nina.’ After depositing his funds, he attempted to make a withdrawal, but received an email from customerservice.dahua@gmail.com stating that his withdrawal had been interrupted because his digital currency exceeds the taxable limit. In the same message he was instructed to pay 20% of the “total profit of the financial platform” or 6382.65 USDT to receive his withdrawal. The victim has not recovered any of his money and the website is no longer operational.","Primary Subject":"Dahua Top VIP Dahuag VIP"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim was introduced by an acquaintance to a Defi Trading platform. The victim purchased Tether USDT crypto currency from Crypto.com, then connected his offline wallet to the exchange and began trading USDT\/Bitcoin futures contracts. The victim believed he was trading very successfully, so he transferred more money into the platform and believed his acquaintance was also crediting money into his account as well. The victim made a small withdrawal early in the process to \"test\" the process and his withdrawal went through. But after more \"successful\" trades, the victim attempted to make a larger withdrawal. At that point, the exchange informed him it did not allow such a large withdrawal, citing “anti-money laundering” protocol established by the “International Banking Regulatory Bureau,” which required him to trade at least 50% of their deposits in their trading account within 24 hours of attempting a withdrawal. So, the victim deposited more funds into his account, and was told his acquaintance had transferred money into his account as well, so he could withdraw the amount he wanted. The exchange called this process a “recharge.” Again, the victim believed had made more successful trades and now had enough money to make his planned withdraw as he met the minimum trade threshold. This time, the exchange denied the withdrawal request, again citing the “International Banking Regulatory Bureau” concern that his account was being used for money laundering, effectively freezing my account to withdrawals. The victim asked how he could prove he was not a money launderer and was told by the exchange he would need to deposit into his wallet the exact amount he had been trying to withdraw, which was $650,000. The victim contacted his trading partner\/acquaintance, and she stated her account had also been frozen and that he would need to comply with the exchanges’ instructions. He asked customer service what to do and was told if he transferred the $650,000 and provided a screen shot of the balance, they would release the funds. The victim took out a loan and deposited about half of the $650,000 in two installments into what he believed was a safe account for such purposes. But as soon as the second deposit went in, without his consent or knowledge the exchange moved the money into his trading account. He protested but was told this was to secure his funds while he finished the verification process. And that the only way to access his money would be to deposit the remaining funds to get to $650,000, although they said they would allow him to trade in the account – just not make withdrawals. His money is now trapped, and he is concerned that there might be problems with the exchange. He is also suspicious about his acquaintance, who told him she followed the exchange’s instructions, borrowed money, and was finally able to withdraw her money and thus encouraged him to borrow more money as well.  ","Primary Subject":"Dapps-eth.io"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim was introduced by an acquaintance to a Defi Trading platform. The victim purchased Tether USDT crypto currency from Crypto.com, then connected his offline wallet to the exchange and began trading USDT\/Bitcoin futures contracts. The victim believed he was trading very successfully, so he transferred more money into the platform and believed his acquaintance was also crediting money into his account as well. The victim made a small withdrawal early in the process to \"test\" the process and his withdrawal went through. But after more \"successful\" trades, the victim attempted to make a larger withdrawal. At that point, the exchange informed him it did not allow such a large withdrawal, citing “anti-money laundering” protocol established by the “International Banking Regulatory Bureau,” which required him to trade at least 50% of their deposits in their trading account within 24 hours of attempting a withdrawal. So, the victim deposited more funds into his account, and was told his acquaintance had transferred money into his account as well, so he could withdraw the amount he wanted. The exchange called this process a “recharge.” Again, the victim believed had made more successful trades and now had enough money to make his planned withdraw as he met the minimum trade threshold. This time, the exchange denied the withdrawal request, again citing the “International Banking Regulatory Bureau” concern that his account was being used for money laundering, effectively freezing my account to withdrawals. The victim asked how he could prove he was not a money launderer and was told by the exchange he would need to deposit into his wallet the exact amount he had been trying to withdraw, which was $650,000. The victim contacted his trading partner\/acquaintance, and she stated her account had also been frozen and that he would need to comply with the exchanges’ instructions. He asked customer service what to do and was told if he transferred the $650,000 and provided a screen shot of the balance, they would release the funds. The victim took out a loan and deposited about half of the $650,000 in two installments into what he believed was a safe account for such purposes. But as soon as the second deposit went in, without his consent or knowledge the exchange moved the money into his trading account. He protested but was told this was to secure his funds while he finished the verification process. And that the only way to access his money would be to deposit the remaining funds to get to $650,000, although they said they would allow him to trade in the account – just not make withdrawals. His money is now trapped, and he is concerned that there might be problems with the exchange. He is also suspicious about his acquaintance, who told him she followed the exchange’s instructions, borrowed money, and was finally able to withdraw her money and thus encouraged him to borrow more money as well.  ","Primary Subject":"Dapps-eth.io"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Gina Lee’ online who asked him to wire money to the Meta Trader 5 platform to trade cryptocurrency through Dilong Trading Limited. Then his bank called and warned him it’s possibly a fraud scheme. Victim lost $120,000.","Primary Subject":"Dilong Trading Limited Affirm Rich Trading Company Limited"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California resident reports they recently fell victim to a scam, after they met a stranger online who offered to teach him how to make money trading crypto options. The stranger walked the victim through how to setup apps and create a Coinbase wallet. The stranger encouraged the victim to start by investing $2,850. Then, the stranger told the victim they were making profits and pushed him to add more funds. Eventually the victim even took out loans to put in more money, as the stranger directed him. Right before Christmas, the Victim was successfully able withdraw $5,000. Eventually, the Victim believed his account balance contained more money than he had ever seen in his lifetime and tried to make another withdrawal from the Coinbase wallet. This time, the Victim was told by a “customer service” person via the Telegram app that he now needed to pay “taxes” in the amount of 25% of his profits before they would release his funds. At this point, the Victim realized it was a scam. He tried to get his money back, even complaining to someone named Sarah he was corresponding with who claimed to be the “CEO of Crypto Customer Service.” The Victim lost $165,286.55.","Primary Subject":"ETH Finance ETH-Finance.io"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim reports that “Bill” reached out to her via Instagram where they communicated for about 2 weeks before Bill asked to move the conversation to WhatsApp. Bill then mentioned trading in crypto assets and asked if she was interested. The victim agreed and Bill sent her the links and instructed her on how to create accounts on and the platform Energise Trade. With Bill’s help, the victim started trading Etheruem (ETH) on Energise Trade platform. Eventually, the victim had made dozens of transactions, and was ready to withdraw her funds. At that point, she was told by Energise Trade customer service that she had to pay taxes first. Then she was told that because she had used another ID number (i.e., Bill’s Energise account) she would pay taxes again, this time from her own account. After that, she was told to deposit more money to increase her credit score so that she could withdraw a larger amount of funds. At this point, the victim realized it was a scam. The victim reports losing about $203,900 to the scam.","Primary Subject":"Energise Trade energisetrade.com"},{"Type":"Imposter Scam","Complaint Narrative":"The victim met “Mia” on WhatsApp who told him about an investment opportunity he thought was related to the Chicago Merchant Exchange. Victim was directed by the online stranger to send money to a website. Victim invested nearly $25,000 and was emailed account statements from cme.authority@gmail.com showing he had made profits of nearly $100,000. When the victim tried to withdraw funds, he received an email stating he needed to pay another $24,000 in taxes to release the funds. The company also claimed penalties would be charged if the taxes weren’t paid on time. Victim became suspicious that the company was using a gmail.com email address and realized he had been scammed for approximately $60,000 total. The company operated the websites at https:\/\/cmecrypto.com; cme886.cuz; cmebuy.com; and xcmerde3.top.      ","Primary Subject":"Entity Impersonating CME Group\/XCME TEAM"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"The victim met “Mia” on WhatsApp who told him about an investment opportunity he thought was related to the Chicago Merchant Exchange. Victim was directed by the online stranger to send money to a website. Victim invested nearly $25,000 and was emailed account statements from cme.authority@gmail.com showing he had made profits of nearly $100,000. When the victim tried to withdraw funds, he received an email stating he needed to pay another $24,000 in taxes to release the funds. The company also claimed penalties would be charged if the taxes weren’t paid on time. Victim became suspicious that the company was using a gmail.com email address and realized he had been scammed for approximately $60,000 total. The company operated the websites at https:\/\/cmecrypto.com; cme886.cuz; cmebuy.com; and xcmerde3.top.      ","Primary Subject":"Entity Impersonating CME Group\/XCME TEAM"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Mia” on WhatsApp who told him about an investment opportunity he thought was related to the Chicago Merchant Exchange. Victim was directed by the online stranger to send money to a website. Victim invested nearly $25,000 and was emailed account statements from cme.authority@gmail.com showing he had made profits of nearly $100,000. When the victim tried to withdraw funds, he received an email stating he needed to pay another $24,000 in taxes to release the funds. The company also claimed penalties would be charged if the taxes weren’t paid on time. Victim became suspicious that the company was using a gmail.com email address and realized he had been scammed for approximately $60,000 total. The company operated the websites at https:\/\/cmecrypto.com; cme886.cuz; cmebuy.com; and xcmerde3.top.      ","Primary Subject":"Entity Impersonating CME Group\/XCME TEAM"},{"Type":"Romance Scam","Complaint Narrative":"The victim met “Mia” on WhatsApp who told him about an investment opportunity he thought was related to the Chicago Merchant Exchange. Victim was directed by the online stranger to send money to a website. Victim invested nearly $25,000 and was emailed account statements from cme.authority@gmail.com showing he had made profits of nearly $100,000. When the victim tried to withdraw funds, he received an email stating he needed to pay another $24,000 in taxes to release the funds. The company also claimed penalties would be charged if the taxes weren’t paid on time. Victim became suspicious that the company was using a gmail.com email address and realized he had been scammed for approximately $60,000 total. The company operated the websites at https:\/\/cmecrypto.com; cme886.cuz; cmebuy.com; and xcmerde3.top.      ","Primary Subject":"Entity Impersonating CME Group\/XCME TEAM"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California resident reports that he lost more than $750,000 after striking up a relationship with a scammer calling herself “Jenny Wang.” The two communicated primarily over the instant messaging app Line Chat, and “Jenny” convinced the victim that he could make a lot of money trading cryptocurrency.","Primary Subject":"Entity Impersonating Singapore Exchange, Coinhako (coinhakoxds.com)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Victim reported meeting “Li Xiao” on LinkedIn, who then suggested they move further communication onto the Line app. There, Li Xiao claimed that she could offer advice on how to trade Binary Options through cryptocurrency and sent an invite link onto the platform. However, instead of downloading an app, the platform asked Victim to download a “configuration profile” onto his Apple device. Victim believed they were dealing with the Singapore International Monetary Exchange Limited, or Simex. Victim transferred approximately $480,000 worth of cryptocurrency from crypto.com to Simex in eight transactions. Victim was able to withdraw various small amounts from $100 to $2,500, but when he tried to withdraw $500,000 his request was rejected.    ","Primary Subject":"Entity Impersonating Singapore International Monetary Exchange Limited or Singapore Internal Financial Exchange (SIMEX\/SGX)"},{"Type":"Imposter Scam","Complaint Narrative":"Victim reported meeting “Li Xiao” on LinkedIn, who then suggested they move further communication onto the Line app. There, Li Xiao claimed that she could offer advice on how to trade Binary Options through cryptocurrency and sent an invite link onto the platform. However, instead of downloading an app, the platform asked Victim to download a “configuration profile” onto his Apple device. Victim believed they were dealing with the Singapore International Monetary Exchange Limited, or Simex. Victim transferred approximately $480,000 worth of cryptocurrency from crypto.com to Simex in eight transactions. Victim was able to withdraw various small amounts from $100 to $2,500, but when he tried to withdraw $500,000 his request was rejected.    ","Primary Subject":"Entity Impersonating Singapore International Monetary Exchange Limited or Singapore Internal Financial Exchange (SIMEX\/SGX)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Victim reported meeting “Li Xiao” on LinkedIn, who then suggested they move further communication onto the Line app. There, Li Xiao claimed that she could offer advice on how to trade Binary Options through cryptocurrency and sent an invite link onto the platform. However, instead of downloading an app, the platform asked Victim to download a “configuration profile” onto his Apple device. Victim believed they were dealing with the Singapore International Monetary Exchange Limited, or Simex. Victim transferred approximately $480,000 worth of cryptocurrency from crypto.com to Simex in eight transactions. Victim was able to withdraw various small amounts from $100 to $2,500, but when he tried to withdraw $500,000 his request was rejected.    ","Primary Subject":"Entity Impersonating Singapore International Monetary Exchange Limited or Singapore Internal Financial Exchange (SIMEX\/SGX)"},{"Type":"Identity Theft","Complaint Narrative":"A California resident reported that they received an email purporting to be from a company they use to hold a crypto asset wallet that read “Your wallet will be suspended, and your assets will be frozen.” It went on to say that as a regulated financial company, in order to comply with KYC (“Know Your Customers”) rules they were required to verify all wallets on their platform. The email provided a link that read “Verify your wallet.” The California resident reports that the email was sent by an imposter posing as the real wallet company. The DFPI cautions consumers about scammers who impersonate a legitimate business to gain access to a user's systems and personal information for financial gain.  ","Primary Subject":"Entity Impersonating Trust Wallet"},{"Type":"Imposter Scam","Complaint Narrative":"A California resident reported that they received an email purporting to be from a company they use to hold a crypto asset wallet that read “Your wallet will be suspended, and your assets will be frozen.” It went on to say that as a regulated financial company, in order to comply with KYC (“Know Your Customers”) rules they were required to verify all wallets on their platform. The email provided a link that read “Verify your wallet.” The California resident reports that the email was sent by an imposter posing as the real wallet company. The DFPI cautions consumers about scammers who impersonate a legitimate business to gain access to a user's systems and personal information for financial gain.  ","Primary Subject":"Entity Impersonating Trust Wallet"},{"Type":"Hacking","Complaint Narrative":"A California resident clicked on a website that appeared as a sponsored ad on Google. The website address is shown as appradiantcapital.com or appradiant-capital.org. Once the California resident opened the website, someone attempted to open her wallet extensions and connect to different chains, and also repeatedly requested access to her assets in other accounts. The victim was able to freeze her accounts before losing any funds. The web address resembles that of Radiant Capital but does not belong to Radiant Capital at https:\/\/radiant.capital\/.DFPI warns consumers and investors to beware of companies or websites pretending to be someone or something else.  ","Primary Subject":"Entity Impersonating legitimate crypto platform Radiant Capital"},{"Type":"Imposter Scam","Complaint Narrative":"A California resident clicked on a website that appeared as a sponsored ad on Google. The website address is shown as appradiantcapital.com or appradiant-capital.org. Once the California resident opened the website, someone attempted to open her wallet extensions and connect to different chains, and also repeatedly requested access to her assets in other accounts. The victim was able to freeze her accounts before losing any funds. The web address resembles that of Radiant Capital but does not belong to Radiant Capital at https:\/\/radiant.capital\/.DFPI warns consumers and investors to beware of companies or websites pretending to be someone or something else.  ","Primary Subject":"Entity Impersonating legitimate crypto platform Radiant Capital"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim was approached by Wenya “Alisa” Chen via Instagram, who then asked them to move the conversation to WhatsApp to continue a friendly relationship. At some point, Alisa introduced him to trading cryptocurrency options through a platform called “Changellytrade”. At different points, the victim was able to withdraw $11,000 and then $50,000. Eventually the victim transferred $1.2 million and believed his options trading had increased the value of the account to $1.35 million and then to more than $2.5 million. But when he attempted to withdraw his entire account, the order was stopped, and his account was blocked. He was then told that they could reactivate the account, if he paid a fee. He began to research and realized his money was not at Changelly.com, but at the fraudulent changellytrade.com.    ","Primary Subject":"Entity Impersonating legitimate exchange Changelly (https:\/\/changelly.com\/)"},{"Type":"Imposter Scam","Complaint Narrative":"A California victim was approached by Wenya “Alisa” Chen via Instagram, who then asked them to move the conversation to WhatsApp to continue a friendly relationship. At some point, Alisa introduced him to trading cryptocurrency options through a platform called “Changellytrade”. At different points, the victim was able to withdraw $11,000 and then $50,000. Eventually the victim transferred $1.2 million and believed his options trading had increased the value of the account to $1.35 million and then to more than $2.5 million. But when he attempted to withdraw his entire account, the order was stopped, and his account was blocked. He was then told that they could reactivate the account, if he paid a fee. He began to research and realized his money was not at Changelly.com, but at the fraudulent changellytrade.com.    ","Primary Subject":"Entity Impersonating legitimate exchange Changelly (https:\/\/changelly.com\/)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim was approached by Wenya “Alisa” Chen via Instagram, who then asked them to move the conversation to WhatsApp to continue a friendly relationship. At some point, Alisa introduced him to trading cryptocurrency options through a platform called “Changellytrade”. At different points, the victim was able to withdraw $11,000 and then $50,000. Eventually the victim transferred $1.2 million and believed his options trading had increased the value of the account to $1.35 million and then to more than $2.5 million. But when he attempted to withdraw his entire account, the order was stopped, and his account was blocked. He was then told that they could reactivate the account, if he paid a fee. He began to research and realized his money was not at Changelly.com, but at the fraudulent changellytrade.com.    ","Primary Subject":"Entity Impersonating legitimate exchange Changelly (https:\/\/changelly.com\/)"},{"Type":"Advance Fee Scam","Complaint Narrative":"A California Victim reports that he was approached online by a person claiming to be Benito Revilla about a crypto investment. In fact, it was a scam, and the website the scammer used, https:\/\/benitorevilla.com., is impersonating a legitimate broker-dealer agent in Texas, employed by USAA Investment Services. Working with USAA Investment Services, DFPI has posted a Consumer Alert about this imposter (https:\/\/dfpi.ca.gov\/2023\/01\/20\/website-https-benitorevilla-com-is-fraudulently-posing-as-a-california-licensed-investment-adviser\/) and urges consumers to exercise extreme caution before responding to any solicitation offering investment or financial services. The victim in this case lost $500 after the scammer promised a profit in 10-days.      ","Primary Subject":"Entity impersonating Benito Revilla"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California Victim reports that he was approached online by a person claiming to be Benito Revilla about a crypto investment. In fact, it was a scam, and the website the scammer used, https:\/\/benitorevilla.com., is impersonating a legitimate broker-dealer agent in Texas, employed by USAA Investment Services. Working with USAA Investment Services, DFPI has posted a Consumer Alert about this imposter (https:\/\/dfpi.ca.gov\/2023\/01\/20\/website-https-benitorevilla-com-is-fraudulently-posing-as-a-california-licensed-investment-adviser\/) and urges consumers to exercise extreme caution before responding to any solicitation offering investment or financial services. The victim in this case lost $500 after the scammer promised a profit in 10-days.      ","Primary Subject":"Entity impersonating Benito Revilla"},{"Type":"Imposter Scam","Complaint Narrative":"A California Victim reports that he was approached online by a person claiming to be Benito Revilla about a crypto investment. In fact, it was a scam, and the website the scammer used, https:\/\/benitorevilla.com., is impersonating a legitimate broker-dealer agent in Texas, employed by USAA Investment Services. Working with USAA Investment Services, DFPI has posted a Consumer Alert about this imposter (https:\/\/dfpi.ca.gov\/2023\/01\/20\/website-https-benitorevilla-com-is-fraudulently-posing-as-a-california-licensed-investment-adviser\/) and urges consumers to exercise extreme caution before responding to any solicitation offering investment or financial services. The victim in this case lost $500 after the scammer promised a profit in 10-days.      ","Primary Subject":"Entity impersonating Benito Revilla"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California Victim reports that he was approached online by a person claiming to be Benito Revilla about a crypto investment. In fact, it was a scam, and the website the scammer used, https:\/\/benitorevilla.com., is impersonating a legitimate broker-dealer agent in Texas, employed by USAA Investment Services. Working with USAA Investment Services, DFPI has posted a Consumer Alert about this imposter (https:\/\/dfpi.ca.gov\/2023\/01\/20\/website-https-benitorevilla-com-is-fraudulently-posing-as-a-california-licensed-investment-adviser\/) and urges consumers to exercise extreme caution before responding to any solicitation offering investment or financial services. The victim in this case lost $500 after the scammer promised a profit in 10-days.      ","Primary Subject":"Entity impersonating Benito Revilla"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California resident reports that his elderly father has been scammed by a stranger on the internet. He says his father received a phone call from a stranger who then gained his trust by sending text message, and encouraging him to begin communicating through the Line app. Eventually, the stranger convinced the victim she could give him investment advice, and helped the victim move money in and out of bank accounts, retirement accounts and crypto exchanges. The victim eventually lost at least $2.7 million.","Primary Subject":"Entity impersonating Prosperous Group Ltd, prospers.business"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim met “Diana” on WhatsApp who convinced them to “invest” $7,200 in an account on a website called “ExNow.” After a couple of months, the victim's account balance appeared to have grown to $239,167. When the victim tried to withdraw that money, ExNow required them to make an upfront payment of $35,000 toward taxes on their gains. The victim then tried to withdraw their original investment of $7,200, but were still instructed to pay the $35,000 first. To date, the victim has been unable to withdraw their money from ExNow and the website is no longer operational.","Primary Subject":"ExNow ExNow-Digital Currency Exchange"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California resident was persuaded by a love interest they met online to download an app called FPMOTC. The love interest showed how lucrative this app was for making money. The victim took out a loan to purchase crypto assets and then transferred them to an account they opened on the FPMOTC app. But when the victim wanted to withdraw funds, they were told that the account was frozen. First, the app told the victim to deposit more money to confirm it was their account. After the victim did so, they were told to deposit even more money, otherwise a fee of 10% would be taken from their account each day. The victim was unable to recover their assets and the website is no longer operational.    ","Primary Subject":"FPMOTC"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California resident was persuaded by a love interest they met online to download an app called FPMOTC. The love interest showed how lucrative this app was for making money. The victim took out a loan to purchase crypto assets and then transferred them to an account they opened on the FPMOTC app. But when the victim wanted to withdraw funds, they were told that the account was frozen. First, the app told the victim to deposit more money to confirm it was their account. After the victim did so, they were told to deposit even more money, otherwise a fee of 10% would be taken from their account each day. The victim was unable to recover their assets and the website is no longer operational.    ","Primary Subject":"FPMOTC"},{"Type":"Romance Scam","Complaint Narrative":"A California resident was persuaded by a love interest they met online to download an app called FPMOTC. The love interest showed how lucrative this app was for making money. The victim took out a loan to purchase crypto assets and then transferred them to an account they opened on the FPMOTC app. But when the victim wanted to withdraw funds, they were told that the account was frozen. First, the app told the victim to deposit more money to confirm it was their account. After the victim did so, they were told to deposit even more money, otherwise a fee of 10% would be taken from their account each day. The victim was unable to recover their assets and the website is no longer operational.    ","Primary Subject":"FPMOTC"},{"Type":"Imposter Scam","Complaint Narrative":"The victim started investing and trading on what he believed was a cryptocurrency platform. He believed he had made profit and requested a withdrawal from the platform. He was told he needed to pay taxes on the profits before he could withdraw, which he did, but then was told that had overpaid the tax by a few cents, and therefore had to pay the entire tax amount again. After he made that tax payment, the platform said he would be charged a 10% Platform Service charges. He then provided a new crypto wallet address for the withdrawal funds but was told the withdrawal would be blocked unless he paid another 10% for address verification. When he paid that, he was told because he had made multiple transactions, he needed to re-verify his account and pay another 10% fee on the balance. After paying the verification charges, he was told his account had been frozen again due to multiple withdrawal attempts and that he had to pay another 10% fee. After paying the fee to unfreeze his account, he was told because his credit score was not good, he needed to pay approximately $40,000 to fix his credit score. He paid the money fix his credit score and was charged another 10% service fee. Then his account was frozen again, and he was told to pay another $10,000 to unfreeze it. He made the payment in two installments but was told they did not accept the second installment and that he needed to repay that installment again of his account would be frozen again. He repaid that second installment amount by the deadline and was he had missed it because it was based on Eastern Standard Time and the victim was in California. Thus, they asked him to repay that amount again within 7 days or they would freeze the funds again. The victim reports he invested his life savings of approximately $600,000, taken multiple loans from banks, withdrew my 401k savings, and borrowed money from friends hoping to get his money back. The company operated the websites at daoftxdex.com.","Primary Subject":"FTX DEX"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Yun Wang” on the Facebook Dating App. She got him interested in Ethereum cryptocurrency mining and sent him a link for a company in which he could invest, fun-eth.com. Victim opened a Coinbase wallet and transferred money to fun-eth.com with Yun Wang’s encouragement. He believed he had profits of more than $14,000, but then his money disappeared. The company operated the websites at https:\/\/fun-eth.com and https:\/\/eth-fun.com.    ","Primary Subject":"FUN ETH"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Yun Wang” on the Facebook Dating App. She got him interested in Ethereum cryptocurrency mining and sent him a link for a company in which he could invest, fun-eth.com. Victim opened a Coinbase wallet and transferred money to fun-eth.com with Yun Wang’s encouragement. He believed he had profits of more than $14,000, but then his money disappeared. The company operated the websites at https:\/\/fun-eth.com and https:\/\/eth-fun.com.    ","Primary Subject":"FUN ETH"},{"Type":"Romance Scam","Complaint Narrative":"The victim met “Yun Wang” on the Facebook Dating App. She got him interested in Ethereum cryptocurrency mining and sent him a link for a company in which he could invest, fun-eth.com. Victim opened a Coinbase wallet and transferred money to fun-eth.com with Yun Wang’s encouragement. He believed he had profits of more than $14,000, but then his money disappeared. The company operated the websites at https:\/\/fun-eth.com and https:\/\/eth-fun.com.    ","Primary Subject":"FUN ETH"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California resident alerted the DFPI that the website fxalliance-traders.com promised high yields on crypto assets but really stole people’s money. The website is no longer operational.","Primary Subject":"FX Alliance Traders fxalliance-trader.com fxalliance-traders.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim got a notification on the Viber App about “fast profits in Bitcoin investments.” Intrigued, the victim followed a link to “Filecoins Foundation.” There, he was connected with “Adeline” who convinced him she could teach him how to trade Bitcoin. Over time he sent $58,130.15 to the site. Following Adeline’s instructions, he believed he was trading Bitcoin every day and the website showed his account had grown to $1.5 million. But when he tried to withdraw his money, he was told he needed to a “profit tax” of approximately $26,000.00. He told them to just withdraw that from his profits but was told he had to pay the tax before they would transfer the money. The victim at that point knew he had been scammed. He borrowed money from friends to invest, and realizes all the profits are fake, but still hopes he can get the money he invested back as this has greatly affected his whole family.","Primary Subject":"File Coins Foundation File-coinfo.com"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"A California victim received an email which included a link to https:\/\/firstmining.top\/account\/. When he clicked the link, he accessed documents that showed he had an account with crypto assets in it that had accumulated more than $38,000 dollars from the website’s ”cloud mining” operations. The victim tried to access the funds, but was instructed that they needed to pay a small fee first and was asked to provide their banking account information. The victim paid the fees but did not receive any money, and the website is no longer operational.","Primary Subject":"First Mining Bitcoin firstmining.top"},{"Type":"Imposter Scam","Complaint Narrative":"The victim joined a trading blog on social media where he met “Mr. Charlie” and “Tina” claiming to be from Fitbela Epro Limited (“Fitbela”), a Forex currency trading company, located in the United Kingdom. Mr. Charlie and Tina convinced the victim to open a Forex trading account on the Meta 5 Trading platform, promising high returns. The victim sent $10,000 and was told that his account had quickly increased in value and was encouraged to invest even more, eventually investing $92,000, wiring the money from his bank account as Mr. Charlie and Tina directed. After he was told his investment was worth $200,000, the victim requested a full withdrawal of the funds in his account. At that point, he was told he needed to pay $87,000 in taxes before he could receive the funds. The victim now believes it was a scam. The company operated the websites at https:\/\/fitbela.org; https:\/\/fitbelaepro.com.tw; https:\/\/fitbela.com; and https:\/\/fitbela.xyz.    ","Primary Subject":"Fitbela Epro Limited (Fitbela)"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"The victim joined a trading blog on social media where he met “Mr. Charlie” and “Tina” claiming to be from Fitbela Epro Limited (“Fitbela”), a Forex currency trading company, located in the United Kingdom. Mr. Charlie and Tina convinced the victim to open a Forex trading account on the Meta 5 Trading platform, promising high returns. The victim sent $10,000 and was told that his account had quickly increased in value and was encouraged to invest even more, eventually investing $92,000, wiring the money from his bank account as Mr. Charlie and Tina directed. After he was told his investment was worth $200,000, the victim requested a full withdrawal of the funds in his account. At that point, he was told he needed to pay $87,000 in taxes before he could receive the funds. The victim now believes it was a scam. The company operated the websites at https:\/\/fitbela.org; https:\/\/fitbelaepro.com.tw; https:\/\/fitbela.com; and https:\/\/fitbela.xyz.    ","Primary Subject":"Fitbela Epro Limited (Fitbela)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim joined a trading blog on social media where he met “Mr. Charlie” and “Tina” claiming to be from Fitbela Epro Limited (“Fitbela”), a Forex currency trading company, located in the United Kingdom. Mr. Charlie and Tina convinced the victim to open a Forex trading account on the Meta 5 Trading platform, promising high returns. The victim sent $10,000 and was told that his account had quickly increased in value and was encouraged to invest even more, eventually investing $92,000, wiring the money from his bank account as Mr. Charlie and Tina directed. After he was told his investment was worth $200,000, the victim requested a full withdrawal of the funds in his account. At that point, he was told he needed to pay $87,000 in taxes before he could receive the funds. The victim now believes it was a scam. The company operated the websites at https:\/\/fitbela.org; https:\/\/fitbelaepro.com.tw; https:\/\/fitbela.com; and https:\/\/fitbela.xyz.    ","Primary Subject":"Fitbela Epro Limited (Fitbela)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim reports he met “Xingzhao Li” on Facebook who directed him to move the conversation to WhatsApp where they became friends. No romance was involved, just shared interests and friendly chat. She built up the victim’s trust and claimed to have an aunt who managed a successful cryptocurrency analyst group for a large investment company. Xingzhao introduced the victim to “node mining,” which she explained involved “swap” contracts that bet on the value of Bitcoin increasing in the short term. She showed the victim how to open an account at the website FoundryPro.net and victim invested a modest amount of from an account set up at crypto.com. The victim made an initial investment, and after he made a profit, he was able to withdraw the crypto assets and even convert them to money. The victim then proceeded to invest more money. At some point, the FoundryPro.net platform told him that because the profits in his account were greater than his principal invested, he needed to pay an “absenteeism fee” to cover the mining costs. The victim paid that, then attempted to withdraw $1 million from FoundryPro.net and deposit into Binance.US. Although the FoundryPro.net website showed the transfer was successful, the money never showed up in his Binance wallet. When he complained, he was told he needed to pay a 5% “recovery fee” or $50,000. After this, he was told his FoundryPro.net account was “frozen” because he had requested too many withdrawals in too short a period. Then, he lost contact with both FoundryPro.net, and Xingzhao. At some point the victim looked up Xingzhao’s “aunt” but couldn’t find any record of her working at the firm she claimed she did. He has lost more than $2 million in this scam.","Primary Subject":"Foundry Pro Node Mining Foundrypro.net"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim was referred by a friend to gechains.com, a cryptocurrency trading platform. Victim opened an account, and started trading with a small amount of money, but then got a call from “Betty” an associate at GE Chains, who asked the victim to put more money into the trading account, so the victim deposited $5,000 more into account. Betty pushed him again to put more money in, so he deposited $5,000 more. Then a week later Betty asked him to deposit another $10,000. This time, the victim said no, and was told his account was suspended. The victim asked to withdraw his money, and after about a week Betty agreed he could withdraw his money if he paid commissions to her of 20% . She also told him his account balance had grown to more than $28,000 and the commissions would be based on that amount. The victim borrowed more than $5,600 from a friend to pay for it , but still couldn’t withdraw his money. Betty then told her to get his friend, who also had not been able to withdraw money, to put more money in, then they both could withdraw together. The victim pleaded with Betty to let him withdraw his money, so she put him in contact with the “service department” where he talked to “Susie” who told him he to pay a tax 15%, or more than $4,200, within a few days or else his account would be permanently frozen, and his account would be turned over to a “monetary authority” who would sue him for his money. The company operated the website https:\/\/GEChains.com.","Primary Subject":"GE Chains"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Ms Vianne” on the LINE app. Vianne convinced the victim to open an account with HGEex to trade options for profit. Vianne showed the victim she had made profits and asked him to help her trade, which he thought he was doing successfully. Vianne then convinced the victim he should invest his own money. He sent more than $20,000 to a cryptocurrency exchange, then transferred the cryptocurrency to an account on the HGEex website. At some point, he tried to withdraw some of his funds, but was told by HGEex customer service that his account was frozen. They also sent an email saying: “Hello, upon inquiry, your investment profit in this exchange has exceeded 100% of the principal amount and has met the tax requirement. According to the cryptocurrency tax requirements, you need to pay 30% of your total assets (7950.384 USDT) as personal income tax. Your account can be restored to normal use after the tax is paid.” At this point, the victim realized it was a scam, and tried to talk to Ms Vianne on LINE. Vianne told the victim that she did pay the exchange tax and was able to get 80% reimbursed. The company operated the website at HGEex.com.  ","Primary Subject":"HGEex.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Ms Vianne” on the LINE app. Vianne convinced the victim to open an account with HGEex to trade options for profit. Vianne showed the victim she had made profits and asked him to help her trade, which he thought he was doing successfully. Vianne then convinced the victim he should invest his own money. He sent more than $20,000 to a cryptocurrency exchange, then transferred the cryptocurrency to an account on the HGEex website. At some point, he tried to withdraw some of his funds, but was told by HGEex customer service that his account was frozen. They also sent an email saying: “Hello, upon inquiry, your investment profit in this exchange has exceeded 100% of the principal amount and has met the tax requirement. According to the cryptocurrency tax requirements, you need to pay 30% of your total assets (7950.384 USDT) as personal income tax. Your account can be restored to normal use after the tax is paid.” At this point, the victim realized it was a scam, and tried to talk to Ms Vianne on LINE. Vianne told the victim that she did pay the exchange tax and was able to get 80% reimbursed. The company operated the website at HGEex.com.  ","Primary Subject":"HGEex.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met a man online, and they began a relationship. After talking about the future, the scammer told her that for a better retirement she should invest in Hodlsofltd.com. Victim transferred money into a cryptocurrency exchange and then invested in the website. She was told she needed to keep her money there for four months before she could withdraw. She could view her account statement online showing large returns. However after four months, when she tried to withdraw her money, the company starting making excuses for not giving her money back. The company operated a website at https:\/\/HodlSoftLtd.com.    ","Primary Subject":"HODL Soft Ltd"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met a man online, and they began a relationship. After talking about the future, the scammer told her that for a better retirement she should invest in Hodlsofltd.com. Victim transferred money into a cryptocurrency exchange and then invested in the website. She was told she needed to keep her money there for four months before she could withdraw. She could view her account statement online showing large returns. However after four months, when she tried to withdraw her money, the company starting making excuses for not giving her money back. The company operated a website at https:\/\/HodlSoftLtd.com.    ","Primary Subject":"HODL Soft Ltd"},{"Type":"Romance Scam","Complaint Narrative":"The victim met a man online, and they began a relationship. After talking about the future, the scammer told her that for a better retirement she should invest in Hodlsofltd.com. Victim transferred money into a cryptocurrency exchange and then invested in the website. She was told she needed to keep her money there for four months before she could withdraw. She could view her account statement online showing large returns. However after four months, when she tried to withdraw her money, the company starting making excuses for not giving her money back. The company operated a website at https:\/\/HodlSoftLtd.com.    ","Primary Subject":"HODL Soft Ltd"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California Victim opened a digital wallet on HOO.com and deposited money. At some point, he believed he had $10,000 in his account. Then, HOO.com claimed it was going to change his money into their own token “HUSDT.” The victim says this rendered his account valueless. Now neither his wallet nor the HOO website are functioning.","Primary Subject":"HOO.com HOO Tech Ltd"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met a stranger on WhatsApp calling herself “Lydia ( Chin Liu )” who claimed to live in Manhattan. She encouraged the victim to open an account at MT5 Coin Tiger and said she would teach him to invest. Later, she suggested the victim change to a new platform that Lydia claimed belonged to her family in Hong Kong. Lydia showed the victim how to transfer money from Coin Tiger to her family’s platform, and he made several transfers totaling approximately $30,000. Eventually, his account showed a balance of more than $ 250,000. At some, the website server stopped working. The victim contacted their online customer service and was told there in the process of performing maintenance and upgrading, and they would contact him by email when it was complete. Instead, he was no longer able to access the website. The victim sent numerous messages to Lydia, but she only told him to be patient and wait for the website to complete its maintenance. The company operated the website at https:\/\/www.helius.pro\/en\/.","Primary Subject":"Helius Capital Limited Helius.pro"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim received a friend request on Facebook from “Helen” (aka Zhong Leying) who eventually persuaded him to invest in crypto assets. She sent him a link to the trading platform “Hong Kong Selead Group Limited” where he registered for a foreign exchange trading account. The victim made multiple wire transfers to the site, sending approximately $2.9 million. With the assistance of “Sally” at Hong Kong Selead Customer Service, he thought he was making profitable trades, and eventually believed his account was worth more that $15 million. At some point, Sally helped him transfer his crypto assets to an entity called “Copper Crypto,” which he believed was a legitimate entity, and he communicated with their Customer Specialist “Nicole” on WhatsApp. But when he tried to withdraw his money, Nicole told him he need to pay 20% in tax on his profit, or more than $1.5 million. Nicole told him that according to the regulations of the “Money Authority” the taxes needed to be paid from an external wallet and could not be deducted from his account. The victim then called the FBI and is working with them. He has not been able to get any of his money back. Both UK and Hong Kong authorities have posted warnings about Hong Kong Selead Group. “Copper Crypto” appears to have impersonated another company, even using their logo.","Primary Subject":"Hong Kong Selead Group Limited hkselead.com Copper Crypto (Entity Impersonating Copper Technologies)"},{"Type":"Advance Fee Scam","Complaint Narrative":"The victim was contacted by “George” about a cryptocurrency investment, promising that if she invested $250,000 and the company reached the investment goal, the victim could qualify for seven Ethereum tokens. Not only did the victim lose the $250,000, but the scammers were able to steal another $40,000 from the victim’s wallet. Scammers then told victim she needed to invest another $310,000 by a certain date to get their money back. The company operated a website at https:\/\/www.hydefieco.com.      ","Primary Subject":"Hydefieco"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim was contacted by “George” about a cryptocurrency investment, promising that if she invested $250,000 and the company reached the investment goal, the victim could qualify for seven Ethereum tokens. Not only did the victim lose the $250,000, but the scammers were able to steal another $40,000 from the victim’s wallet. Scammers then told victim she needed to invest another $310,000 by a certain date to get their money back. The company operated a website at https:\/\/www.hydefieco.com.      ","Primary Subject":"Hydefieco"},{"Type":"Liquidity Mining Scam","Complaint Narrative":"The victim was contacted by “George” about a cryptocurrency investment, promising that if she invested $250,000 and the company reached the investment goal, the victim could qualify for seven Ethereum tokens. Not only did the victim lose the $250,000, but the scammers were able to steal another $40,000 from the victim’s wallet. Scammers then told victim she needed to invest another $310,000 by a certain date to get their money back. The company operated a website at https:\/\/www.hydefieco.com.      ","Primary Subject":"Hydefieco"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was contacted by “George” about a cryptocurrency investment, promising that if she invested $250,000 and the company reached the investment goal, the victim could qualify for seven Ethereum tokens. Not only did the victim lose the $250,000, but the scammers were able to steal another $40,000 from the victim’s wallet. Scammers then told victim she needed to invest another $310,000 by a certain date to get their money back. The company operated a website at https:\/\/www.hydefieco.com.      ","Primary Subject":"Hydefieco"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Two California victims report falling victim to the International Cryptocurrency Exchange Trading Platform, which operated various websites to engage in fraud. The first victim met “Serena” on WhatsApp. She showed the victim how to buy crypto assets from legitimate sites, and then transferred it to the crypto trading site, icetrad.cc. After a few weeks of “trading” on the site, Serena said it was time to withdraw the funds. but when the victim tried to do so, he got a message from customer support that he needed to pay taxes, and the website would forward them to the IRS on his behalf. The victim did not fall for this but shortly after the site disappeared with all his money, which was about $14,000. The second victim was involved in WhatsApp group chat, where the group was talking about profits, they made from trading on a platform called ICEX (Intercontinental Exchange). When the victim asked questions, a couple by the name of “Paul” and “Anna Chen Lin” took turns answering them, as did “Nanoor” and “Kawtargh.” Eventually the victim was invited to an online Discord and Telegram community chat group, where they shared a link to ICEX link. “Anna” demonstrated live trading on the icextee.top platform, Through the Discord Channel, the victim was then directed to create an ICEX account and Crypto.com trading account and was walked through how to trade. On his initial investment of $500, he was shown he made a profit of $3,000. After that, the victim took out personal loans totaling $140,000, and borrowed money from friends, hoping to increase profits. At some point, he believed he had made an $890,000 profit. But before he could access anything, he was first asked to pay an “Accounts Verification fee” of $17,000, then $6,000 for taxes. Even though he paid these, he was denied further access to his account. After that, the victim could not reach any of the scammers on any platform he had previously used.","Primary Subject":"ICEXAS.COM ICEAX.COM ICEX (Entity may be impersonating Intercontinental Exchange)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Mike Vestil” on Instagram. They talked and at some point Mike told her she could make money investing. He introduced her to “Jason Brandon”, who offered to show her how to trade Bitcoin to make money. Jason instructed her to start a plan with a minimum of $500-$1000 for 5-7 days trade. The victim transferred Bitcoin into Jason’s wallet at infinityoptions.net. After that, Jason asked for more money and said if the victim didn’t pay she wouldn’t be able to get her money back. The victim lost $18,000. The company operated a website at https:\/\/www.InfinityOption.net.  ","Primary Subject":"Infinity Option"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Mike Vestil” on Instagram. They talked and at some point Mike told her she could make money investing. He introduced her to “Jason Brandon”, who offered to show her how to trade Bitcoin to make money. Jason instructed her to start a plan with a minimum of $500-$1000 for 5-7 days trade. The victim transferred Bitcoin into Jason’s wallet at infinityoptions.net. After that, Jason asked for more money and said if the victim didn’t pay she wouldn’t be able to get her money back. The victim lost $18,000. The company operated a website at https:\/\/www.InfinityOption.net.  ","Primary Subject":"Infinity Option"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim signed up for what she believed to be a cryptocurrency exchange platform called Julysil at http:\/\/justtice.com\/. She registered on the platform through an individual on twitter named ‘Annie.’ The victim attempted to withdraw $36,000 from her account, which she believed held $136,000. However, she was unable to complete the withdrawal, receiving an email stating that it failed due to an incorrect withdrawal address and that the withdrawal funds have been returned to her account. Two days later, the exchange website went offline. Subsequently, the victim received an email from support@julysil-support.com claiming her account was under review by the World Anti-Money Laundering Center and that if she paid $8,000 she would get “priority” review. The victim did not get any of her money back. Julysil appears to have been a scam platform.","Primary Subject":"Julysil julysil-support.com julysil-bit.com julysil-coin.com julysil-pro.com julysilcoin.com julysilpro.com juzhiju.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim was introduced to an AI investment platform through somebody they met on the Facebook dating app. The scammer showed the victim the website for the investment platform – kenskrksr.com – as well as a white paper about the AI trading program. The scammer also introduced the victim to a Telegram discussion channel where others convinced them to invest.","Primary Subject":"Kenskr AI kenskrksr.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Two California victims fell victim to the same fraudulent crypto asset scam after scammers directed them to the website “liquldohn.com\/h5.” The first victim met Fergus Lee through LinkedIn, and they then communicated through the online app Line. Fergus showed the victim how to set up an account on Crypto.com and gave him the link to “liquldohn.com\/h5.” The victim started with $1,000 and got back $607 on his first trade. Fergus then convinced the victim to withdraw from his 401(k) retirement account, and transfer to Liquldohn. The victim sent almost $50,000 in three separate transactions. At some point, the victim believed he had made a profit of more than $200,000. But when he tried to withdraw the funds, Liquldohn’s “customer service” told the victim his account would be frozen and he would have to deposit $18,000 to” unfreeze” it. The victim has not been able to recover funds. The second victim, an elderly man with diminished mental capacity, was reported by a financial advisory firm. The firm reported that their customer was contacted through Linkedin, by someone presenting herself as a computer science major at UC Berkeley, which happened to be the victim’s college alma mater. The scammer convinced the victim to withdraw money from his account at the financial advisory firm and transfer it to Liquldohn.com. The victim transferred $880,000 from a bank account. Later, the victim also attempted to withdraw $220,000 from his trust account and $40,000 from his IRA account, but the financial advisory firm denied this request and reported the fraud to DFPI.  ","Primary Subject":"LIQULDOHN.COM"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Two California victims fell victim to the same fraudulent crypto asset scam after scammers directed them to the website “liquldohn.com\/h5.” The first victim met Fergus Lee through LinkedIn, and they then communicated through the online app Line. Fergus showed the victim how to set up an account on Crypto.com and gave him the link to “liquldohn.com\/h5.” The victim started with $1,000 and got back $607 on his first trade. Fergus then convinced the victim to withdraw from his 401(k) retirement account, and transfer to Liquldohn. The victim sent almost $50,000 in three separate transactions. At some point, the victim believed he had made a profit of more than $200,000. But when he tried to withdraw the funds, Liquldohn’s “customer service” told the victim his account would be frozen and he would have to deposit $18,000 to” unfreeze” it. The victim has not been able to recover funds. The second victim, an elderly man with diminished mental capacity, was reported by a financial advisory firm. The firm reported that their customer was contacted through Linkedin, by someone presenting herself as a computer science major at UC Berkeley, which happened to be the victim’s college alma mater. The scammer convinced the victim to withdraw money from his account at the financial advisory firm and transfer it to Liquldohn.com. The victim transferred $880,000 from a bank account. Later, the victim also attempted to withdraw $220,000 from his trust account and $40,000 from his IRA account, but the financial advisory firm denied this request and reported the fraud to DFPI.  ","Primary Subject":"LIQULDOHN.COM"},{"Type":"Advance Fee Scam","Complaint Narrative":"A victim reported they met “Lisa Harris”, who had a presence on multiple online platforms (i.e., Telegram ID@LisaHarrisup, https:\/\/t.me\/lisareviews, and Telegram channel name Lisa Trader.) Lisa enticed the victim with an investment opportunity that promised good returns in 24 hours. Victim sent $100 worth of crypto assets through kucoin exchange, but never got back any principal or profit.  ","Primary Subject":"Lisa Harris"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim believed he was trading on the cryptocurrency exchange platform, https:\/\/www.mt7coin.com\/. The victim had initially invested approximately $700 in the exchange and believed his account had grown to over $10,000. Hoping to cash out his earnings, he tried to make a withdrawal. Instead, he was contacted by an individual named “Dora” who insisted that although the exchange owes him $9,500, he would need to pay $500 as a prerequisite to receiving his funds. The website is no longer operational and the victim did not get any of his money back.","Primary Subject":"MT7 Coin mt7coin.com"},{"Type":"Advance Fee Scam","Complaint Narrative":"The victim met “Dylan Lee” on Zoosk and started communicating with him on WhatsApp. Dylan told the victim he invested in Bitcoin and invited her to invest. The victim made an initial investment of $3,000. Dylan then told the victim her account was now worth $250,00 with interest. Dylan told the victim to withdraw the money from MUFG Pro, but they told the victim she had to pay $42,000 in taxes. Then MUFG Pro told the victim her account was frozen and she had to pay $32,00 to unfreeze it. After she paid that, she was told to pay more money to a third party to deal with another issue with her account. Victim finally realized it was a scam. The company operated the websites at https:\/\/www.mu-fgpro.info and Mufg-Pro.com.    ","Primary Subject":"MUFG Pro"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Dylan Lee” on Zoosk and started communicating with him on WhatsApp. Dylan told the victim he invested in Bitcoin and invited her to invest. The victim made an initial investment of $3,000. Dylan then told the victim her account was now worth $250,00 with interest. Dylan told the victim to withdraw the money from MUFG Pro, but they told the victim she had to pay $42,000 in taxes. Then MUFG Pro told the victim her account was frozen and she had to pay $32,00 to unfreeze it. After she paid that, she was told to pay more money to a third party to deal with another issue with her account. Victim finally realized it was a scam. The company operated the websites at https:\/\/www.mu-fgpro.info and Mufg-Pro.com.    ","Primary Subject":"MUFG Pro"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Dylan Lee” on Zoosk and started communicating with him on WhatsApp. Dylan told the victim he invested in Bitcoin and invited her to invest. The victim made an initial investment of $3,000. Dylan then told the victim her account was now worth $250,00 with interest. Dylan told the victim to withdraw the money from MUFG Pro, but they told the victim she had to pay $42,000 in taxes. Then MUFG Pro told the victim her account was frozen and she had to pay $32,00 to unfreeze it. After she paid that, she was told to pay more money to a third party to deal with another issue with her account. Victim finally realized it was a scam. The company operated the websites at https:\/\/www.mu-fgpro.info and Mufg-Pro.com.    ","Primary Subject":"MUFG Pro"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim complains about an internet scammer going by the name of Manapool, which claims to be a decentralized crypto trading platform whose web address www.Manapool-eth.info\/# works in the browser page of Coinbase wallet, a popular crypto app. The victim got into decentralized crypto trading after meeting a woman on the internet who claimed to be from mainland China. Since September of 2022, the victim invested millions of dollars through Manapool. At some point, the victim decided to cash out and asked Manapool to put his coins back into his Coinbase wallet. Manapool told him he would have to pay $548,00 for “platform service charge” which he paid. Then Manapool said he needed to pay a $521,000 “margin deposit” which he did. Then he was asked to pay another $325,000. The victim protested, saying the process was taking way too long. So, Manapool said he could pay another $250,000 for “VIP service” to speed up the process. Just when he thought he had finally completed the withdrawal process Manapool told him his account was at risk because it had received an unknown deposit and asked him to pay more than a million dollars to resolve it, or they would freeze or close his account. The victim spent almost all his retirement money trying to get his money out and now believes Manapool is a scam that has to be stopped before it can do harm to more victims.","Primary Subject":"Mana Pool manapool-eth.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim participated in a livestream event on YouTube where subject offered “2 for 1 airdrop of Bitcoin or Ethereum, i.e., any Send will be returned with twice the Receive, up to 25000 ETH & 5000 BTC” for 24 hours. Victim sent 3 ETH and received a message from a Chat agent (translated from Russian as “Thanks for allowing me to eat.”) Victim then realized it was a scam. The company operated a website at https:\/\/airdrop-strategy.com.","Primary Subject":"MicroStrategy US (Entity impersonating MicroStrategy)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim opened an account with MindStone Technology Ltd. (mindstoneltd.org) hoping to trade crypto assets. They deposited $91,000 dollars onto the trading platform. At some point, the victim asked for their money back and received an email stating that the refund was successful. The victim reports that the funds never arrived in their digital wallet and the website is no longer operational.","Primary Subject":"Mindstone Technology Ltd mindstoneltd.org"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim met a lady by the name of Lucy Barney aka Lucy Lee on LinkedIn who gained the victims’ trust by stating she wanted to start a non-profit to help autistic children. The victim believed \"Lucy” who said they could make money by trading in crypto assets. Lucy helped the victim set up an account on moodyfx.com account and showed them how to wire money to an exchange to purchase crypto assets and then transfer them to the Moodysfx account, which offered a deposit bonus. The victim deposited $10,000 and believed they made $800.00 on the first trade. After that, the victim deposited $315,000. Lucy told the victim she would need another $685,000 to make the account worth $1million because that would result in another bonus. At some point, the victim believed their trading profits were close to $400,000. But when the victim tried to make a withdrawal, the website denied the victim's request to withdraw funds, indicating that the account might be involved in money laundering.","Primary Subject":"Moodysfx Global Limited Moodyfx.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim was contacted on WhatsApp by a woman named “Letty” claiming she knew him. They texted back and forth and became friends. One day Letty showed the victim how much she made trading gold on the Meta Trader 5 trading platform. At first, Letty had the victim set up a demo account to show how it was done. Then, Letty proposed he set up a real account and sent a website link where he could deposit cryptocurrency to get started trading. The victim thought the website looked very suspicious, so did an internet search and discovered a Consumer Alert on the DFPI website about a similar scam.  ","Primary Subject":"NATSLE.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was contacted on WhatsApp by a woman named “Letty” claiming she knew him. They texted back and forth and became friends. One day Letty showed the victim how much she made trading gold on the Meta Trader 5 trading platform. At first, Letty had the victim set up a demo account to show how it was done. Then, Letty proposed he set up a real account and sent a website link where he could deposit cryptocurrency to get started trading. The victim thought the website looked very suspicious, so did an internet search and discovered a Consumer Alert on the DFPI website about a similar scam.  ","Primary Subject":"NATSLE.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California Victim was approached by “Hao Yang” who instructed him to buy cryptocurrency on Coinbase and send it a website called “NYMEX” where he believed he had opened an account. Eventually he invested more than $650,000. At some point, his NYMEX account showed it was worth at least $10 million funds, but when he tried to withdraw the funds, he could no longer contact the company.    ","Primary Subject":"NYMEX (Entity impersonating New York Mercantile Exchange)"},{"Type":"Imposter Scam","Complaint Narrative":"A California Victim was approached by “Hao Yang” who instructed him to buy cryptocurrency on Coinbase and send it a website called “NYMEX” where he believed he had opened an account. Eventually he invested more than $650,000. At some point, his NYMEX account showed it was worth at least $10 million funds, but when he tried to withdraw the funds, he could no longer contact the company.    ","Primary Subject":"NYMEX (Entity impersonating New York Mercantile Exchange)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California Victim was approached by “Hao Yang” who instructed him to buy cryptocurrency on Coinbase and send it a website called “NYMEX” where he believed he had opened an account. Eventually he invested more than $650,000. At some point, his NYMEX account showed it was worth at least $10 million funds, but when he tried to withdraw the funds, he could no longer contact the company.    ","Primary Subject":"NYMEX (Entity impersonating New York Mercantile Exchange)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim accepted a Friend Request on Facebook from “Alvin Robel.” After exchanging pleasantries, “Alvin” asked to move the chat to WhatsApp where victim thought they were developing a relationship. After a few months, Alvin brought up trading cryptocurrencies as a way to help achieve financial goals. Alvin instructed the victim how to set up accounts on legitimate crypto platforms like crypto.com and the MetaTrader5 platform. Alvin said they could earn $10 million trading together and told victim she could buy a villa in Croatia. Victim even took out loans to facilitate the aggressive trading goals Alvin had set. Alvin even claimed to have injected his own money into the account after the victim tried to trade on her own. Finally, Alvin told the victim the account was worth $1.25 million, and he was going to fly out to California to meet her. He then claimed he was in San Francisco, but had to quarantine due to COVID. At that point, victim was contacted by a “broker” who told her she needed to $95 in capital gains taxes to get the money out. After she paid that, the “broker” claimed the victim owed “spread fees” of $35,000. Victim has given more than $245,000 to the scammer including money taken out as loans borrowed from family and friends. The company operated a website at https:\/\/obgfx.cc.  ","Primary Subject":"OBFX Global"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim accepted a Friend Request on Facebook from “Alvin Robel.” After exchanging pleasantries, “Alvin” asked to move the chat to WhatsApp where victim thought they were developing a relationship. After a few months, Alvin brought up trading cryptocurrencies as a way to help achieve financial goals. Alvin instructed the victim how to set up accounts on legitimate crypto platforms like crypto.com and the MetaTrader5 platform. Alvin said they could earn $10 million trading together and told victim she could buy a villa in Croatia. Victim even took out loans to facilitate the aggressive trading goals Alvin had set. Alvin even claimed to have injected his own money into the account after the victim tried to trade on her own. Finally, Alvin told the victim the account was worth $1.25 million, and he was going to fly out to California to meet her. He then claimed he was in San Francisco, but had to quarantine due to COVID. At that point, victim was contacted by a “broker” who told her she needed to $95 in capital gains taxes to get the money out. After she paid that, the “broker” claimed the victim owed “spread fees” of $35,000. Victim has given more than $245,000 to the scammer including money taken out as loans borrowed from family and friends. The company operated a website at https:\/\/obgfx.cc.  ","Primary Subject":"OBFX Global"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim thought he was investing in cryptocurrency through the website osoptionsexhchange.com and sent U.S. dollars. Scammers provided screen shots showing profits, but when victim tried to withdraw the money, he lost all contact with company.","Primary Subject":"OS Option Exchange"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A Californian reports to the DFPI that a crypto asset trading platform called OpenSoil claims to operate an App, but rather than being available through a legitimate App store, it can only be installed through a link. The main purpose of the app is to get people to join and add funds to the Open Soil platform to then carry out \"arbitrage trades\". However, there is no evidence such trades were carried out and the complainant indicated they were unable to withdraw their funds. The website is no longer operational. A person named “Demi” claimed to be a Regional Support person. OpenSoil also claimed it was approved by the “California Banking Regulatory Commission.” In fact, no such agency exists that approves crypto asset transaction. The DFPI urges the public to be cautious about companies making such representations.","Primary Subject":"OpenSoil Open Soil X h5.opensoilx.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim was contacted by an individual through Facebook promising great returns in cryptocurrency investing. Victim wired funds to Coinbase to purchase cryptocurrency, then sent that to the MetaTrader5 platform through his mobile device. The scammer showed a demo example where a $100,000 investment could earn profits of $11,000. The scammer showed victim pictures of her lavish lifestyle and said she could help him achieve success. Then the scammer walked the victim through a step-by-step process, transferring his money into the scammer’s account on the platform, then sending screenshots showing she had earned $200,000. The scammer then asked the victim if he wanted to transfer even more money. At that point, he became concerned asked for his money back. The scammer told him he had lost all his money and it was his fault for making bad trades. In all, the victim was scammed out of $10,000. The company operated the website https:\/\/penzolead.com.  ","Primary Subject":"Penzo Limited"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was contacted by an individual through Facebook promising great returns in cryptocurrency investing. Victim wired funds to Coinbase to purchase cryptocurrency, then sent that to the MetaTrader5 platform through his mobile device. The scammer showed a demo example where a $100,000 investment could earn profits of $11,000. The scammer showed victim pictures of her lavish lifestyle and said she could help him achieve success. Then the scammer walked the victim through a step-by-step process, transferring his money into the scammer’s account on the platform, then sending screenshots showing she had earned $200,000. The scammer then asked the victim if he wanted to transfer even more money. At that point, he became concerned asked for his money back. The scammer told him he had lost all his money and it was his fault for making bad trades. In all, the victim was scammed out of $10,000. The company operated the website https:\/\/penzolead.com.  ","Primary Subject":"Penzo Limited"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim sent bitcoin that he owned to cryptocurrency platform pinance.io. He decided to move his bitcoin, worth around $21,000 at the time, to pinance.io based on the favorable online reviews he read. Unfortunately, the site was a scam and ultimately shutdown in October 5, 2021. The victim has not recovered any of his bitcoin. It appears that at least 36 other people were victims of this scam.","Primary Subject":"Pinance.io"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim claims this website is holding money he deposited to invest in cryptocurrency and demanding he pay taxes before he can withdraw. When he asked customer service why he couldn’t withdraw money and pay the taxes on his, the said if he didn’t pay the taxes to them he faced consequences such as negatively affecting his credit score, and possibly prison. The company operated the website at https:\/\/ poloina.com\/EfyF.html.","Primary Subject":"Poloina"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The company, Private Money, advertises itself as a private crypto wallet available at https\/\/privmoney.com. A California resident deposited 18 Bitcoin, and now cannot withdraw.","Primary Subject":"Privmoney Private Money"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met a woman calling herself “Jiang Yingying” on social media and they communicated on WhatsApp, Telegram, and through text messaging. At some point, Jiang convinced him to open a crypto account, so he transferred $500 from his debit card, then transferred the cryptocurrency to a Chinese exchange at first called rbhoodc.com, but later it changed its name to rbhoodz.com, then changed again to rbhoodd.xyz. The victim even got a loan for $13,000 which he also deposited into rbhoodc.com through his Crypto.com account. Jiang kept saying he was making money and should add more capital, so he got another $9,500 loan and wired it to Coinbase. At some point, the victim tried to withdraw some of the money, but Jiang told him he had to pay taxes. Victim then spoke to a customer service agent at the exchange who also told him he had to pay taxes on the money before he could withdraw it. The company operated the websites at https:\/\/rbhoodc.com; rbhoodz.com; and rbhoodd.xyz.","Primary Subject":"RB Hood (Entity impersonating a Robinhood-related entity)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Aimee Liu Jing” online on the dating site OkCupid. Aimee asked to continue the conversation on WhatsApp. Aimee then offered to teach the victim about trading digital assets. The victim purchased cryptocurrency through the Coinbase platform and then transferred money to an App which victim thought was associated with a legitimate company. Victim transferred more than $1 million in 10 different transactions, as directed by Aimee. At some point, Aimee told the victim that the market was unstable, and he should withdraw all the money. But when he tried to withdraw a small amount, the wallet app asked him to confirm his identity and provide identification, which he did, using his US passport as identification. He also provided his bank information for the deposit.","Primary Subject":"Rakuten OPD (Entity impersonating Rakuten)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California Victim was persuaded to invest in Bitcoin mining by an old Navy Friend via Instagram. Victim made many separate transactions and deposits starting in May 2022. The victim was told they were assigned a broker named Taylor Williams who would communicate via WhatsApp, The victim was told his money was earning profits through Bitcoin mining and he believed his account balance had increased from $13,700 and changed to $20,000 at some point. But when the victim tried to withdraw his money, instead Taylor Williams gave them the run around, first making claims like: “this is the last step of the process” and “withdrawal should have gone through by now, “then telling the victim if didn’t pay a fee ASAP the company would close his account. The Victim then asked to switched brokers. The next broker was also named “Taylor” and communicated through WhatsApp. Things were no better with the new Taylor, who gave the victim the same experience as the first broker. The victim did a search online and found information that the company was a scam. He then filed a complaint with DFPI and reported it to the police. Victim can no longer access the rapidforextrade.com website, but “Taylor” still tries to contact him. The Victim has not received any money back.","Primary Subject":"Rapid Forex Trade RapidForexTrade.com"},{"Type":"Advance Fee Scam","Complaint Narrative":"The victim met “Mrs. Linda” and they communicated through WhatsApp. At some point, Linda convinced the victim to open an account with Reliable Option Trade and told him to deposit $500. Victim then got a message from the company’s Support Team saying he could get Bitcoin if he deposited another $1,000 into his account. Then he was asked to deposit another $3,500 but he told them he didn’t have that amount, so they convinced him to invest $2,000 instead. Later he was told his account was worth $24,000 so the victim decided to withdraw his money. He filled out the withdrawal form and submitted it, then got a call from broker who offered to trade for the victim so he could make more money. The broker advised him to download the Trust Wallet app, which he did. Now he cannot get his money out of the Trust Wallet, and he is still being asked by the broker to put in more money. The company operated a website at https:\/\/www.reliableoptiontrade.com.    ","Primary Subject":"Reliable Option Trade"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Mrs. Linda” and they communicated through WhatsApp. At some point, Linda convinced the victim to open an account with Reliable Option Trade and told him to deposit $500. Victim then got a message from the company’s Support Team saying he could get Bitcoin if he deposited another $1,000 into his account. Then he was asked to deposit another $3,500 but he told them he didn’t have that amount, so they convinced him to invest $2,000 instead. Later he was told his account was worth $24,000 so the victim decided to withdraw his money. He filled out the withdrawal form and submitted it, then got a call from broker who offered to trade for the victim so he could make more money. The broker advised him to download the Trust Wallet app, which he did. Now he cannot get his money out of the Trust Wallet, and he is still being asked by the broker to put in more money. The company operated a website at https:\/\/www.reliableoptiontrade.com.    ","Primary Subject":"Reliable Option Trade"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Mrs. Linda” and they communicated through WhatsApp. At some point, Linda convinced the victim to open an account with Reliable Option Trade and told him to deposit $500. Victim then got a message from the company’s Support Team saying he could get Bitcoin if he deposited another $1,000 into his account. Then he was asked to deposit another $3,500 but he told them he didn’t have that amount, so they convinced him to invest $2,000 instead. Later he was told his account was worth $24,000 so the victim decided to withdraw his money. He filled out the withdrawal form and submitted it, then got a call from broker who offered to trade for the victim so he could make more money. The broker advised him to download the Trust Wallet app, which he did. Now he cannot get his money out of the Trust Wallet, and he is still being asked by the broker to put in more money. The company operated a website at https:\/\/www.reliableoptiontrade.com.    ","Primary Subject":"Reliable Option Trade"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Hoping to set up a “node” on the Rhenium network, a California victim sought help from an administrator on the Rhenium discord channel. The victim got a response via a direct message from someone claiming to be an representative of Rhenium who sent them an .exe file to help convert their virtual private server (VPS) into a node on the Rhenium network. The .exe file worked and turned the victim’s VPS into a node. However, the victim later discovered all of their crypto wallets open on their computer screen and all of their crypto transferred out. The victim lost over $50,000 worth of crypto assets as a result of the scam.","Primary Subject":"Rhenium Nodium"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim sent approximately $15,000 worth of cryptocurrency to a trading platform to trade and earn money. But when he tried to withdraw some funds, the platform’s customer service rejected his request, saying he needed to pay taxes or approximately $23,000 first. After he paid that amount, customer service told him it would take 15 business days to complete the tax deduction. He waited more than 2 months, and now the customer service won’t respond anymore. The company operated the website at rudolfstarkeps.com.","Primary Subject":"Rudolf Stark Pro Station rudolfstarkeps.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim was introduced to “Enze Zhao” in a WeChat group. Zhao told the victim he was interested in her, and they continued to communicate. The victim gradually fell in love, believing she and Zhao shared many interests and values. Zhao told the victim he was an economics major and his hobby is to earn extra money through Rui Win Capitals LTD. Zhao convinced the victim they had a future together, but wanted her to do better financially, so they could build a house together in the Bay area. Zhao then suggested he could teach the victim to invest Gold Dollars on Meta Traders 5 through Rui Win. She put in $500,000, and Zhao told her she had completed a deal successfully and now had more than a million. But, she was told she had to pay 20% tax on the profit.  She paid, but still couldn't get her money back. Then the Rui Win customer service suggested that if she sent in 10% of her balance, she would become a VIP and get all her money back.  So, she sent in the 10% of what she thought was her online balance, more than $130,000 believing she would become a VIP. Then the customer service claimed that the platform had stopped functioning and she would have to wait for it to reopen. Meanwhile, Zhao asked her to keep sending him money to help him from getting into trouble, or he would go to jail. Eventually, Zhao stopped contacting the victim, she could no longer contact customer service at Rui Win, and she has lost close to $1 million.","Primary Subject":"Rui Win Capitals LTD"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was introduced to “Enze Zhao” in a WeChat group. Zhao told the victim he was interested in her, and they continued to communicate. The victim gradually fell in love, believing she and Zhao shared many interests and values. Zhao told the victim he was an economics major and his hobby is to earn extra money through Rui Win Capitals LTD. Zhao convinced the victim they had a future together, but wanted her to do better financially, so they could build a house together in the Bay area. Zhao then suggested he could teach the victim to invest Gold Dollars on Meta Traders 5 through Rui Win. She put in $500,000, and Zhao told her she had completed a deal successfully and now had more than a million. But, she was told she had to pay 20% tax on the profit.  She paid, but still couldn't get her money back. Then the Rui Win customer service suggested that if she sent in 10% of her balance, she would become a VIP and get all her money back.  So, she sent in the 10% of what she thought was her online balance, more than $130,000 believing she would become a VIP. Then the customer service claimed that the platform had stopped functioning and she would have to wait for it to reopen. Meanwhile, Zhao asked her to keep sending him money to help him from getting into trouble, or he would go to jail. Eventually, Zhao stopped contacting the victim, she could no longer contact customer service at Rui Win, and she has lost close to $1 million.","Primary Subject":"Rui Win Capitals LTD"},{"Type":"Romance Scam","Complaint Narrative":"The victim was introduced to “Enze Zhao” in a WeChat group. Zhao told the victim he was interested in her, and they continued to communicate. The victim gradually fell in love, believing she and Zhao shared many interests and values. Zhao told the victim he was an economics major and his hobby is to earn extra money through Rui Win Capitals LTD. Zhao convinced the victim they had a future together, but wanted her to do better financially, so they could build a house together in the Bay area. Zhao then suggested he could teach the victim to invest Gold Dollars on Meta Traders 5 through Rui Win. She put in $500,000, and Zhao told her she had completed a deal successfully and now had more than a million. But, she was told she had to pay 20% tax on the profit.  She paid, but still couldn't get her money back. Then the Rui Win customer service suggested that if she sent in 10% of her balance, she would become a VIP and get all her money back.  So, she sent in the 10% of what she thought was her online balance, more than $130,000 believing she would become a VIP. Then the customer service claimed that the platform had stopped functioning and she would have to wait for it to reopen. Meanwhile, Zhao asked her to keep sending him money to help him from getting into trouble, or he would go to jail. Eventually, Zhao stopped contacting the victim, she could no longer contact customer service at Rui Win, and she has lost close to $1 million.","Primary Subject":"Rui Win Capitals LTD"},{"Type":null,"Complaint Narrative":" ","Primary Subject":"SOLANAFTX"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim was messaged on Facebook by a stranger calling herself by “Belen Li”. After a few weeks of communicating, Belen Li offered to teach the victim how to trade cryptocurrency. She encouraged the victim to open a Crypto.com account and transfer money to the Meta Trader 5 trading platform and then into an account he opened at a website Belen Li told him about. Belen Li convinced the victim he had made a series of small, successful trades, and then asked him to transfer more than $5,303.00 from his Cyrpto.com wallet. After a few days, he told his account was closed and his funds were gone. He talked to “Kelly” via WhatsApp who claimed to be a Customer Service Manager for the website, who told him he was unable to access his account. The company operated the website at SantanMarkets.co.    ","Primary Subject":"SantanMarkets.co"},{"Type":"Imposter Scam","Complaint Narrative":"The victim was messaged on Facebook by a stranger calling herself by “Belen Li”. After a few weeks of communicating, Belen Li offered to teach the victim how to trade cryptocurrency. She encouraged the victim to open a Crypto.com account and transfer money to the Meta Trader 5 trading platform and then into an account he opened at a website Belen Li told him about. Belen Li convinced the victim he had made a series of small, successful trades, and then asked him to transfer more than $5,303.00 from his Cyrpto.com wallet. After a few days, he told his account was closed and his funds were gone. He talked to “Kelly” via WhatsApp who claimed to be a Customer Service Manager for the website, who told him he was unable to access his account. The company operated the website at SantanMarkets.co.    ","Primary Subject":"SantanMarkets.co"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was messaged on Facebook by a stranger calling herself by “Belen Li”. After a few weeks of communicating, Belen Li offered to teach the victim how to trade cryptocurrency. She encouraged the victim to open a Crypto.com account and transfer money to the Meta Trader 5 trading platform and then into an account he opened at a website Belen Li told him about. Belen Li convinced the victim he had made a series of small, successful trades, and then asked him to transfer more than $5,303.00 from his Cyrpto.com wallet. After a few days, he told his account was closed and his funds were gone. He talked to “Kelly” via WhatsApp who claimed to be a Customer Service Manager for the website, who told him he was unable to access his account. The company operated the website at SantanMarkets.co.    ","Primary Subject":"SantanMarkets.co"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim discovered a crypto asset trading website named Spotalertweb.com through a Telegram group. The victim opened an account, deposited $1,000.00, and began trading. But when the victim wanted to withdraw their money, the website asked for their crypto asset wallet address to begin the process. After they provided that, the website asked them to transfer more crypto assets to the website to process the transfer. The victim was unable to get their money back from the trading platform. Instead, $85,000.00 worth of crypto currency was transferred out of the victims’ crypto asset wallet and the website is no longer operational.  ","Primary Subject":"Spotalertweb.com"},{"Type":"Hacking","Complaint Narrative":"A California victim discovered a crypto asset trading website named Spotalertweb.com through a Telegram group. The victim opened an account, deposited $1,000.00, and began trading. But when the victim wanted to withdraw their money, the website asked for their crypto asset wallet address to begin the process. After they provided that, the website asked them to transfer more crypto assets to the website to process the transfer. The victim was unable to get their money back from the trading platform. Instead, $85,000.00 worth of crypto currency was transferred out of the victims’ crypto asset wallet and the website is no longer operational.  ","Primary Subject":"Spotalertweb.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim invested $100,000 in online trading company through the Meta Trader 5 trading platform and started trading. At some point, he believed he had made profits exceeding $1.5 million, and made a request with the company to withdraw. They told him he needed to make a “risk deposit” of more than $300,000, which he deposited, and they then told him to wait one to three days for the funds to arrive in his crypto.com account. When his funds didn’t arrive after five days he asked the company, but this time they said he needed to pay a $100,000 penalty. He did not get his money back. The company operated a website at https:\/\/www.crm.stunwill.com.","Primary Subject":"Stunwill Limited"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim reported a multilayered scam operation orchestrated by Sunbitproa.com where she transferred approximately 13 Ethereum via a Binance wallet. The company operated the website at https:\/\/SunBitProa.com.","Primary Subject":"Sun Bit Proa"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Two Californians complained separately about the gold trading platform, Sundell Ltd. (Sundell-fx.com).","Primary Subject":"Sundell Ltd Sundell FX Sundell-fx.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met a woman he thought was in love with him. After victim shared his dream of wanting to buy a motor home and travel, the scammer convinced him she could help him reach his goal through cryptocurrency. The victim gave the scammer $64,000 to invest in Tahoe Digital Exchange. The scammer then told him his investment was now worth almost $200,000. But when the victim tried to transfer the money out, Tahoe Digital Exchange told him he needed to pay more than $30,000 in taxes. After that, Tahoe Digital Exchange asked for another $20,000 for him to get his money back. The victim had no more money, so Tahoe Digital Exchange froze his assets, and he never heard from the woman again. The company operated a website at https:\/\/Tahoe-dex.com\/dist.    ","Primary Subject":"Tahoe Digital Exchange (Ta.hoe)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met a woman he thought was in love with him. After victim shared his dream of wanting to buy a motor home and travel, the scammer convinced him she could help him reach his goal through cryptocurrency. The victim gave the scammer $64,000 to invest in Tahoe Digital Exchange. The scammer then told him his investment was now worth almost $200,000. But when the victim tried to transfer the money out, Tahoe Digital Exchange told him he needed to pay more than $30,000 in taxes. After that, Tahoe Digital Exchange asked for another $20,000 for him to get his money back. The victim had no more money, so Tahoe Digital Exchange froze his assets, and he never heard from the woman again. The company operated a website at https:\/\/Tahoe-dex.com\/dist.    ","Primary Subject":"Tahoe Digital Exchange (Ta.hoe)"},{"Type":"Romance Scam","Complaint Narrative":"The victim met a woman he thought was in love with him. After victim shared his dream of wanting to buy a motor home and travel, the scammer convinced him she could help him reach his goal through cryptocurrency. The victim gave the scammer $64,000 to invest in Tahoe Digital Exchange. The scammer then told him his investment was now worth almost $200,000. But when the victim tried to transfer the money out, Tahoe Digital Exchange told him he needed to pay more than $30,000 in taxes. After that, Tahoe Digital Exchange asked for another $20,000 for him to get his money back. The victim had no more money, so Tahoe Digital Exchange froze his assets, and he never heard from the woman again. The company operated a website at https:\/\/Tahoe-dex.com\/dist.    ","Primary Subject":"Tahoe Digital Exchange (Ta.hoe)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California resident was on Twitter when a pop-up ad appeared stating “Welcome to 5000BTC GiveAway!” He clicked the link and was taken to “thebigmars.com” website where took a quiz and passed. He then got a message that read “To participate, send the amount you want multiplied (from 0.02BTC to 1 BTC) to the address below and, once we have received your transaction, we will immediately send the multiplied amount back (from 0.10BTC to 10BTC) to your address!”","Primary Subject":"The Big Mars thebigmars.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim was introduced to Tokenswap.net by “Hayley” who told him he could make money. Victim invested several times and believed he had made a profit, but when he tried to withdraw the money he was first told he needed to make a deposit for taxes owed to the IRS. Then, he received an email from the website that asked him to submit a selfie holding an ID card, personal bank statements for the past three months, and a deposit of 30% of the total market value of his account, after which the website said it would review his withdrawal request. When the victim refused, he received another email saying if he did not pay the deposit within 5 days, he would not be able to withdraw his money, and that they had the right to freeze his account and “blacklist” him. The company operated the website at https:\/\/tokenswap.net.  ","Primary Subject":"Token Swap"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was introduced to Tokenswap.net by “Hayley” who told him he could make money. Victim invested several times and believed he had made a profit, but when he tried to withdraw the money he was first told he needed to make a deposit for taxes owed to the IRS. Then, he received an email from the website that asked him to submit a selfie holding an ID card, personal bank statements for the past three months, and a deposit of 30% of the total market value of his account, after which the website said it would review his withdrawal request. When the victim refused, he received another email saying if he did not pay the deposit within 5 days, he would not be able to withdraw his money, and that they had the right to freeze his account and “blacklist” him. The company operated the website at https:\/\/tokenswap.net.  ","Primary Subject":"Token Swap"},{"Type":"Advance Fee Scam","Complaint Narrative":"The victim said that Tony Alin Berker asked them for $6,000 to invest, saying there would be no other fees. Then, Tony asked the victim for another $11,000 to “merge the accounts.” Then Tony said the victim needed to $8,100 for IRS fees. The victim paid Tony all the money, and he promised the victim they would get $270,000. But the victim never received anything back. Victim also said a good friend also lost $48,000 to Tony Alin Berker. The company operated a website at https:\/\/www.tonyalinberker.com.  ","Primary Subject":"Tony Alin Trading Firm"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim said that Tony Alin Berker asked them for $6,000 to invest, saying there would be no other fees. Then, Tony asked the victim for another $11,000 to “merge the accounts.” Then Tony said the victim needed to $8,100 for IRS fees. The victim paid Tony all the money, and he promised the victim they would get $270,000. But the victim never received anything back. Victim also said a good friend also lost $48,000 to Tony Alin Berker. The company operated a website at https:\/\/www.tonyalinberker.com.  ","Primary Subject":"Tony Alin Trading Firm"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Victim was contacted on Instagram by “Stefanie Kammerman” who said she lived in Las Vegas. Stefanie directed the victim to buy Bitcoin and open a trading account with www.trade1960.com. But when he wanted to take some money out, Stefanie said he had to wait 6 months to withdraw. The victim then emailed www.support@trade1960.com and was told he needed to pay a broker fee of $3,500 in bitcoin. Now he wants his money back. The company operated a website at https:\/\/www.trade1960.com.  ","Primary Subject":"Trade 1960"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Victim was contacted on Instagram by “Stefanie Kammerman” who said she lived in Las Vegas. Stefanie directed the victim to buy Bitcoin and open a trading account with www.trade1960.com. But when he wanted to take some money out, Stefanie said he had to wait 6 months to withdraw. The victim then emailed www.support@trade1960.com and was told he needed to pay a broker fee of $3,500 in bitcoin. Now he wants his money back. The company operated a website at https:\/\/www.trade1960.com.  ","Primary Subject":"Trade 1960"},{"Type":"Imposter Scam","Complaint Narrative":"A California victim received an email with an official-looking government logo claiming to be from the “U.S. Department of Cyber Security” and that it was the “Official Service for Control and Compensation Payments.” The email claimed that the victim was owed compensation for a cybersecurity breach at Bitcoin. The email had a “Personal notification” number and a link to “Open the official website of the Department.” When the victim clicked the link, he was told to send a “transfer fee” and then the compensation would be transferred to his account. Once the victim sent the fee from his Cash App account, the scammers somehow took all his Bitcoin out of the account, which was his life savings.","Primary Subject":"USDCDE.site Entity Impersonating U.S. Department of Cyber Security Official Service for Control and Compensation Payments"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Yuna Li”, who also called herself “Alicia” on Instagram. Alicia said she resided in West Hollywood, and after chatting for a few days, Alicia told the victim they could make money by trading Ethereum on the Meta Trader 5 (MT5) platform. Alicia said she could get inside information (known as trading signals) from her Uncle working in finances. She told the victim they would only trade when her uncle gave her the signal. Alicia showed the victim how to wire transfer funds to crypto.com and then send to a broker at UNISON FX LIMITED through MT5. Alicia alerted the victim on Instagram when to buy and sell, open a position and setup the take profit limit. After a few weeks, Alicia told the victim he had made around $200,000. At some point the victim tried to withdraw $100,000, as Unison showed he had a balance of approximately $430,000. At that point, the victim’s MT5 app was hacked and his entire account was wiped out. Unison refused any withdrawal and blocked him out of his account. Then Alicia blocked the victim on Instagram and vanished. The victim lost approximately $230,000. The company operated a website at https:\/\/ www.unisonfx.com.  ","Primary Subject":"Unison FX Limited"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Yuna Li”, who also called herself “Alicia” on Instagram. Alicia said she resided in West Hollywood, and after chatting for a few days, Alicia told the victim they could make money by trading Ethereum on the Meta Trader 5 (MT5) platform. Alicia said she could get inside information (known as trading signals) from her Uncle working in finances. She told the victim they would only trade when her uncle gave her the signal. Alicia showed the victim how to wire transfer funds to crypto.com and then send to a broker at UNISON FX LIMITED through MT5. Alicia alerted the victim on Instagram when to buy and sell, open a position and setup the take profit limit. After a few weeks, Alicia told the victim he had made around $200,000. At some point the victim tried to withdraw $100,000, as Unison showed he had a balance of approximately $430,000. At that point, the victim’s MT5 app was hacked and his entire account was wiped out. Unison refused any withdrawal and blocked him out of his account. Then Alicia blocked the victim on Instagram and vanished. The victim lost approximately $230,000. The company operated a website at https:\/\/ www.unisonfx.com.  ","Primary Subject":"Unison FX Limited"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met a person calling themselves “Heitor Ryan” on the internet who claimed to work at a bank. They chatted as friends for several months, then Heitor lured the victim into investing on a crypto website that turned out to be a fraud. Victim thought they were investing in a liquidity mining pool called uniswap.llc that the person online promised would provide a high rate of return based on “tiers” according to the amount invested. The site claimed the investment would stay in U.S. dollars, thus avoiding the risk of being invested in cryptocurrency, and said the investment was perfectly safe. Victim transferred cryptocurrency into an account on the site, and the site showed him making daily returns. But when the victim tried to withdraw the funds, he was told that his wallet address was “abnormal,” and he would need put another $7,000 in to clear it up. Victim has not been able to get the $14,000 he invested back. The company operated the websites at https:\/\/Uniswap.org.","Primary Subject":"Uniswap.LLC (Entity impersonating Uniswap Ltd.)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California widowed mother of four children, reports she fell victim to a crypto investment scam after she befriended “Victoria Ruth” on Facebook who claimed to be a “Senior Expert Trading manager” at “CryptoCurrency forex trade\/bitcoin mining.”. “Victoria” offered to teach the victim how to invest in crypto. Following “Victoria’s” instructions, the victim made a modest $200 initial investment by purchasing bitcoin and transferring it into a Unix FX Trades account for “Victoria.” Her investment appeared to earn incredible interest, and the victim continued to invest under “Victoria’s” guidance. In return for her investment assistance, “Victoria” told the victim she would charge a 20% commission fee for every “cycle” she was invested. The victim was told that the commission could not be paid out of the victim’s investment account (which at one point appeared to have a balance in excess of $4M); instead, the victim needed to send “Victoria” more bitcoin to have the funds released for withdrawal. Despite the victim sending over $10,000, the account was never released, and “Victoria” continued to demand payment for various additional fees.","Primary Subject":"Unix FX Trades unifxtrades.live"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Victim #1, a front-line health care worker, and Victim #2 met with someone on the Muslim social app Salam who called herself “Anna” and exchanged numbers. This person then directed the victims onto WhatsApp where they began a friendship. Anna claimed to work for the community, orphans and doing free medical camps for the low resource populations. At some point Anna introduced the victims to crypto telling them they would never lose as her uncle worked in crypto and her cousin “Rheo” had this exchange, Voyanx and helped them set up an account. The victims transferred $2,000 to Anna who told them she would put the crypto into an account at Voyanx (through a link Anna sent). Anna claimed she would teach the victims how to trade via screenshots and claimed she could earn $1,500 a day. At some point, Anna became intimidating and told the victims to go to the bank for a loan and that she would double their money. The victims transferred another $10,000. The scammer showed screenshots that said the victims’ balance was $141,219. The victims wanted to transfer the crypt profits back into their bank accounts and contacted the Voyanx app customer service online but were told they needed to pay a $42,000 transfer fee. The victims reached out to Anna who convinced them to pay her $20,000 to help her get money from the Voyanx application, and even showed the victims a screenshot showing a successful withdrawal. When the money never actually arrived in the bank accounts, they called the app’s customer service again and were told she needed to transfer another $10,000 for an ID verification. At that point, the victims called Anna and begged for their money back. Anna said if she paid an additional $10,000 she would transfer the whole amount. Later, Victim #1 learned the scammer had hacked into her bank account and phone. The company operated the website https:\/\/VoyanX.com.  ","Primary Subject":"VoyanX.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Victim #1, a front-line health care worker, and Victim #2 met with someone on the Muslim social app Salam who called herself “Anna” and exchanged numbers. This person then directed the victims onto WhatsApp where they began a friendship. Anna claimed to work for the community, orphans and doing free medical camps for the low resource populations. At some point Anna introduced the victims to crypto telling them they would never lose as her uncle worked in crypto and her cousin “Rheo” had this exchange, Voyanx and helped them set up an account. The victims transferred $2,000 to Anna who told them she would put the crypto into an account at Voyanx (through a link Anna sent). Anna claimed she would teach the victims how to trade via screenshots and claimed she could earn $1,500 a day. At some point, Anna became intimidating and told the victims to go to the bank for a loan and that she would double their money. The victims transferred another $10,000. The scammer showed screenshots that said the victims’ balance was $141,219. The victims wanted to transfer the crypt profits back into their bank accounts and contacted the Voyanx app customer service online but were told they needed to pay a $42,000 transfer fee. The victims reached out to Anna who convinced them to pay her $20,000 to help her get money from the Voyanx application, and even showed the victims a screenshot showing a successful withdrawal. When the money never actually arrived in the bank accounts, they called the app’s customer service again and were told she needed to transfer another $10,000 for an ID verification. At that point, the victims called Anna and begged for their money back. Anna said if she paid an additional $10,000 she would transfer the whole amount. Later, Victim #1 learned the scammer had hacked into her bank account and phone. The company operated the website https:\/\/VoyanX.com.  ","Primary Subject":"VoyanX.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Two Californians complained separately about Whitcoin crypto platform.","Primary Subject":"Whitcoin Pro Exchange MercoTax Whitcoinpro.net"},{"Type":"Pig Butchering Scam","Complaint Narrative":"Two Californians separately complain about the crypto asset exchange, wincoinin.com. The first victim met “Lucy Cheong” via LinkedIn and they began having conversations over the phone. After a while, Lucy suggested that they invest together in crypto assets. Lucy showed the victim how to create an account on “crypto.com” and told them to transfer money from their bank into a “Trust Wallet” and then deposit their crypto assets into an account wincoing.com. Lucy told the victim to wait for her signal on when to trade. Lucy told the victim to enter the amount of crypto assets they wanted to trade on the website, pick a % profit they wanted to make, enter a time of 15- 30 seconds, and then hit the “Buy Long” button. Lucy would then direct the victim to hit the “Confirm Order” button. On the very first trade, the website showed they had made a profit. The victim wanted to stop there, but Lucy insisted they trade again and put in even more money. After the third trade the victim wanted to withdraw, and Lucy showed them how to withdraw through the website and said it would take about 10 minutes. After about 30 minutes of the website showing the withdrawal was “in process”, the victim tried to use the website’s online chat service. After waiting 20 minutes, they got a response saying the funds were in process, but they would need to pay a 12% service fee to access their funds, otherwise the website would freeze the funds and charge a .05% daily late fee. The victim now realizes this is a scam. They lost $290,000 which was their life savings. The second victim provided screenshots from wincoining.com showing he invested $184,000.00 and that he had made $47,000.00 in profits from trading but is unable to withdraw his funds.","Primary Subject":"Win Coining wincoining.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"Victim met someone calling herself “Rosalie” on WhatsApp, who introduced him to eth-Wintermute.net, telling the victim this would generates dividends on liquidity pools every 6 hours based on the amount of money put into the MetaMask app wallet. The scammer walked the victim through the process where he downloaded the BinanceUS and MetaMask apps on his phone, then used the MetaMask browser to connect to eth-wintermute.net Victim transferred approximately $130,000 over the course of a few days. Then Rosalie pressured victim to change to an escrow contract, to “lock in his profits” for 7 days, earning higher interest once a day, instead of every 6 hours. After the showed his investment was worth more than $167,170 the victim tried to withdraw but Rosalie, and the “customer support” person on the app, told him he needed to deposit another $84,000 in order to withdraw the full amount. Now, his $167,170 in the DAPP app, and he cannot withdraw it. He contacted the legitimate platform Wintermute.com, who told him that eth-wintermute.net is not part of Wintermute and is not connected with them. Thus, the scammers impersonated the real Wintermute.com's website to fool the victim.","Primary Subject":"Wintermute (Entity Impersonating https:\/\/www.wintermute.com\/)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California resident identified a website (XCointrading.com) that advertised “Buy and Sell Coins at the Crypto with minimal fees of 1%” and stated all user funds were stored on the project wallets. It also said “Do not trust the project – do not make a deposit in any case. Nobody is forcing you to do this! You yourself say this a risk! If this is a risk to you, don’t do it.” The website is no longer operational.","Primary Subject":"X Coin Trading xcoin-trading.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The first victim was contacted on WhatsApp by a stranger claiming they worked for an investment firm called \"Yong Ying Global Investment Co.\" The stranger convinced the victim to wire money using the Meta5 trading platform to purchase crypto currency. Essentially, the victim wired more than $450,000, believing that the money was being put into an investment account. At some point, the victim tried to withdraw the money, but was told he was locked out of his account. Then the stranger blocked him on WhatsApp.  The second victim met a woman on WhatsApp named “Li Sa” and they became friends. Eventually, she offered to show him how to trade foreign exchange on the Meta trader 5 platform and had him register at www.fix-yongying.com. Over a period of months, the victim made multiple transfers of cryptocurrency to the platform and believed he was had made profits of more than $180,000, At some point, the platform informed the victim they had blocked his account and he would need to pay taxes before he could withdraw any money. The company operated the website at fx-yongying.com.","Primary Subject":"Yong Ying Global Investments Co limited"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The first victim was contacted on WhatsApp by a stranger claiming they worked for an investment firm called \"Yong Ying Global Investment Co.\" The stranger convinced the victim to wire money using the Meta5 trading platform to purchase crypto currency. Essentially, the victim wired more than $450,000, believing that the money was being put into an investment account. At some point, the victim tried to withdraw the money, but was told he was locked out of his account. Then the stranger blocked him on WhatsApp.  The second victim met a woman on WhatsApp named “Li Sa” and they became friends. Eventually, she offered to show him how to trade foreign exchange on the Meta trader 5 platform and had him register at www.fix-yongying.com. Over a period of months, the victim made multiple transfers of cryptocurrency to the platform and believed he was had made profits of more than $180,000, At some point, the platform informed the victim they had blocked his account and he would need to pay taxes before he could withdraw any money. The company operated the website at fx-yongying.com.","Primary Subject":"Yong Ying Global Investments Co limited"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Nisa Gacias (aka Champion)” online who introduced to investing in cryptocurrency. He started by transferring $25,000 to the crypto trading platform ZC Exchange, then added $100,000 more. Everything seemed to be fine during this time and as he believed his investment was growing in value, he continued to put in more money. At some point, the victim believed his account held $1.2 million Tether, and he decided to withdraw some money. He was then told before he could withdraw, he needed to pay taxes of $187,000.00 to the trading platform. When the victim asked for an extension to pay, he was told there would be an additional charge of $8,000. Victim refinanced his house and paid the taxes and fee, thinking he would get his money from the investment back. But the company only demanded more money to liberate his funds, so he had to borrow more money from relatives. Despite paying the money, the company still didn't allow him to withdraw funds and kept demanding more funds. So far, the victim has paid more than $400,000 on top of the money he invested. He is only able to communicate online with ZC Exchange’s customer service and cannot get ahold of a live person. Meanwhile, Nisa encouraged him to pay the company so he can get his funds back. The company operated the websites at https:\/\/zcorg01.com and https:\/\/FTXbuy66.com.  ","Primary Subject":"ZC Exchange"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Nisa Gacias (aka Champion)” online who introduced to investing in cryptocurrency. He started by transferring $25,000 to the crypto trading platform ZC Exchange, then added $100,000 more. Everything seemed to be fine during this time and as he believed his investment was growing in value, he continued to put in more money. At some point, the victim believed his account held $1.2 million Tether, and he decided to withdraw some money. He was then told before he could withdraw, he needed to pay taxes of $187,000.00 to the trading platform. When the victim asked for an extension to pay, he was told there would be an additional charge of $8,000. Victim refinanced his house and paid the taxes and fee, thinking he would get his money from the investment back. But the company only demanded more money to liberate his funds, so he had to borrow more money from relatives. Despite paying the money, the company still didn't allow him to withdraw funds and kept demanding more funds. So far, the victim has paid more than $400,000 on top of the money he invested. He is only able to communicate online with ZC Exchange’s customer service and cannot get ahold of a live person. Meanwhile, Nisa encouraged him to pay the company so he can get his funds back. The company operated the websites at https:\/\/zcorg01.com and https:\/\/FTXbuy66.com.  ","Primary Subject":"ZC Exchange"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim received a text from a stranger named “Sally” and began communicating with her. She suggested that they moved their conversations to an app called Telegram. At some point, Sally told the victim he could making money trading cryptocurrency on an online platform and sent him a link to establish an account. Sally then began providing instructions on when to buy and sell the crypto coin Sheb. Victim transferred money from his bank account to the platform, eventually sending approximately $24,000, and believed his account was growing in value. But when he tried to withdraw some money, he was told he needed to pay taxes first. Sally directed him to transfer money from his bank account to the Cryptocurrency Regulatory Authority to pay the taxes. After he did so, the platform told him he missed the deadline, and now needed to pay another $4,000. When he refused to pay this amount, Sally blocked him on Telegram. The company operated the website at api.scbtrader.com.","Primary Subject":"api.scbtrader.com (This is not to be confused with other companies using the name \"Scbtrader\")"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim received a WhatsApp invitation link text to join a trading group called BTC Investment. Victim contacted the group admin “Hannah” who helped her set up her account with bxbcc.com. Victim then transferred $500 and started trading with the group. Victim thought things were going well for a couple weeks and even withdrew some money just to be sure. “Hannah” then pressured her to increase her investment to make more profits, so the victim increased her investment to $5,000. Victim then tried to withdraw more money, but Hannah told her that the funds were frozen until the program ended the following month. Victim really needed the money, so she reached out to the website’s customer service, who told her she would have to pay 5% of her total funds for taxes to withdraw her money. The company operated the website at https:\/\/bxbcc.com.  ","Primary Subject":"bxbcc.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim received a WhatsApp invitation link text to join a trading group called BTC Investment. Victim contacted the group admin “Hannah” who helped her set up her account with bxbcc.com. Victim then transferred $500 and started trading with the group. Victim thought things were going well for a couple weeks and even withdrew some money just to be sure. “Hannah” then pressured her to increase her investment to make more profits, so the victim increased her investment to $5,000. Victim then tried to withdraw more money, but Hannah told her that the funds were frozen until the program ended the following month. Victim really needed the money, so she reached out to the website’s customer service, who told her she would have to pay 5% of her total funds for taxes to withdraw her money. The company operated the website at https:\/\/bxbcc.com.  ","Primary Subject":"bxbcc.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim met “Luna” through social media and they communicated through Telegram and WhatsApp. Luna claimed to live in Manhattan, New York, and own a clothing company. After becoming friendly, one day Luna asked the victim to install an app for trading crypto assets. Luna told the victim you could select the amount you wanted to invest on the app, select whether you thought the crypto asset was going to go up or down and promised returns of 30% to 60%. Luna showed the victim how to use it and said the victim had made a profitable trade. Luna then encouraged the victim to add more money showing her how to wire transfer money to crypto.com, purchased purchase crypto assets, and move them to the exchange app. At some point, the victim tried to withdraw the funds from the exchange app, she was told that her account was blocked, and the app demanded she pay an additional $30,000.00 to have the account unblocked. She cannot recover her money now.","Primary Subject":"bybpoz.com imxofz.vip"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Chris Martin” on the Facebook Dating app. They exchanged text messages and then moved the conversation to Telegram. At some point, “Chris” suggested that the victim invest in crypto currency. The victim transferred a small amount of money to Coinbase and Crypto.com, and then forwarded the crypto currency to the coinbasetv website to test the site and practice trading. Chris helped the victim through the process and also showed her his assets in his own accounts and the victim believed everything was legitimate. After a few weeks, the victim had transferred approximately $280,000 to the website. But when she tried to withdraw money, she was told she needed to pay a fee before she could withdraw the money. When she didn’t pay, they threatened to prosecute her for money laundering. She continues to communicate with Chris, who tells her everything will be okay and that she should get a loan to pay the fee to release the funds. The company operated the website at https:\/\/coinbasetv.com.","Primary Subject":"coinbasetv.com (Entity Impersonating Coinbase)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California victim met “Jenny” on the dating app Hinge who introduced him to a crypto mining operation she was participating in. She seemed very knowledgeable in finance and the victim trusted her to help set up an account with a defi protocol on the website: defi.wallet-usdt-eth-erc20.com. He initially put in $1,000.00 to test the system, and since it appeared to be working, he put in an additional $21,000.00. He though he got great results with the website showing mining rewards accruing in his account which were then deposited directly into his wallet on MetaMask. The wallet showed his initial investment funds as always available, and each day he got mining rewards (about 2%) that could be extracted and put into a wallet linked to a so-called “mining pool”. He chatted daily with Jenny about life and crypto. Then the website advertised a reward scheme that offered 12.5 Ethereum coins for every $100,000.00 invested into the platform. Jenny pressured him quite intensely for almost a month to invest so they could get the reward, but he couldn’t come up with the funds. At some point, he liquidated his IRA and put all the rest of his available money into the website account. His total investment at that time was about $37,000.00, and he believed he had earned rewards of $60,000.00. Then he got a message from the website offering a chance to double his rewards in 7 days. He sent the funds to another crypto address outside and was shown that his account had grown to $80,000.00. He wanted to withdraw his funds then, but when he tried, the website demanded he pay taxes of $12,700.00, so he did. Then, he was told he needed to invest an additional 50% of the total asset amount, (another $40,000.00) so that he could take out the $80,000.00 he believed he was in his wallet. He couldn’t pay, so the website agreed to a lower amount, $10,000.00. Immediately after he sent the money, all his money disappeared, and he can no longer communicate with the website. Jenny stopped communicating with him, too. He lost about $58,000.00.","Primary Subject":"defi.wallet-usdt-eth.com defi.wallet-usdt-erc20.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California resident received a text from a stranger named “Victoria.” When the victim said she got the wrong number, Victoria continued to text the victim and asked that they move the conversation over to the Telegram app. Through these conversations, Victoria revealed she was from Malaysia, but now lives in Beverly Hills, owns multiple properties, co-owns a hair salon, and has investments in real estate, stocks, and crypto. The victim expressed interest in investing in crypto and but told Victoria they didn't know much. Victoria said she got into investing after her aunt, who works on Wall Street, taught her. Victoria showed screen shots of her trades and profits and told the victim that she could teach her how to trade. She showed the victim how to purchase crypto assets on an exchange, then sent a link to the trading platform drwap and showed the victim how to register there. Victoria then showed the victim how to transfer the crypto assets she purchased into their trading account on the DRW platform.  Victoria had the victim start with a small amount, and the victim was able to move $200 on to the platform, then withdraw it back into their wallet on the crypto asset exchange. The victim began to trust the process and regularly deposited more funds to their DRW trading account. Victoria continued to coach the victim, instructing them to copy their trades and put in the same amount of money they were trading. Then, when the victim's DRW account showed a value of $149,962.59, Victoria told them the trading cycle was done, and it was time to take their profits. But when the victim tried to withdraw approximately $ 100,000 from DRW, they got a message saying their assets were frozen and that they needed to contact customer service. Customer service said that because the victim's profits exceeded 100% of the amount deposited, they had to pay a 35% capital gains tax, or approximately $40,000, and that they could not pay taxes from the DRW account but had to pay directly. The victim then realized it was a scam. They lost more than $30,000 and the website is no longer operational.","Primary Subject":"drwaps.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A California resident received a text from a stranger named “Victoria.” When the victim said she got the wrong number, Victoria continued to text the victim and asked that they move the conversation over to the Telegram app. Through these conversations, Victoria revealed she was from Malaysia, but now lives in Beverly Hills, owns multiple properties, co-owns a hair salon, and has investments in real estate, stocks, and crypto. The victim expressed interest in investing in crypto and but told Victoria they didn't know much. Victoria said she got into investing after her aunt, who works on Wall Street, taught her. Victoria showed screen shots of her trades and profits and told the victim that she could teach her how to trade. She showed the victim how to purchase crypto assets on an exchange, then sent a link to the trading platform drwap and showed the victim how to register there. Victoria then showed the victim how to transfer the crypto assets she purchased into their trading account on the DRW platform.  Victoria had the victim start with a small amount, and the victim was able to move $200 on to the platform, then withdraw it back into their wallet on the crypto asset exchange. The victim began to trust the process and regularly deposited more funds to their DRW trading account. Victoria continued to coach the victim, instructing them to copy their trades and put in the same amount of money they were trading. Then, when the victim's DRW account showed a value of $149,962.59, Victoria told them the trading cycle was done, and it was time to take their profits. But when the victim tried to withdraw approximately $ 100,000 from DRW, they got a message saying their assets were frozen and that they needed to contact customer service. Customer service said that because the victim's profits exceeded 100% of the amount deposited, they had to pay a 35% capital gains tax, or approximately $40,000, and that they could not pay taxes from the DRW account but had to pay directly. The victim then realized it was a scam. They lost more than $30,000 and the website is no longer operational.","Primary Subject":"drwaps.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A Californian reported losing more than $45,000 after responding to a text message from “Angela,” who implied she had found his phone number in her old phone and decided to reach out to him. Angela then asked that they continue their conversation on Telegram, where she told the victim she was originally from Belarus but now ran her own Fashion Design company in San Francisco. She told the victim about her financial success and how well she had done with cryptocurrency.","Primary Subject":"http:\/\/www.kubhc.vip https:\/\/www.kubkhy.vip\/download (Entity Impersonating legitimate exchange Kuna.io)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim deposited Bitcoin on several occasions into an account on the cryptocurrency platform altcoins-exchange.com. After being confused by the fees and instructions, the victim called Customer Service but did not get help. Now the victim can’t get her money back. The company operated the website at https: \/\/altcoins-exchange.com. This is not to be confused with the website altcoinexchange.com.","Primary Subject":"https: \/\/altcoins-exchange.com (Entity Impersonating Altcoinexchange.com)"},{"Type":"Imposter Scam","Complaint Narrative":"The victim met a person online calling herself “Anna Lee” who also went by the name “Lina.” Lina lured the victim to a cryptocurrency exchange and said she would help the victim trade in the account to make money. Lina told the victim she had placed $80,000 of her own crypto into the account too to build the victim’s trust. Lina began assisting the victim to trade on the site and eventually told the victim that the account balance had reached $607,000. But when the victim wanted to withdraw the funds, the website told him he needed to pay the $80,000 back to Lina first, so he did. Then the website said he needed to pay $121,000 for taxes, which he paid. He was then told he needed to pay an ACH Fee of $42,000, but the victim could only pay about $25,000. The victim reached out to Lina for a loan, but she refused. Now the victim cannot get his money back. The company operated the website at https:\/\/kacofinance.io. This is not to be confused with the website www.kaco.finance.","Primary Subject":"https:\/\/kacofinance.io (Entity Impersonating Kaco Finance)"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Yin Chang” (who also uses the name “Vivian Change”) through WhatsApp and they started talking on Telegram. He even met her once in a coffee shop in Brentwood, California. At some point, “Vivian” contacted the victim on his cellphone and told him she could help him invest money in crypto currency and get a very good return. Scammer told the victim to invest through the website https:\/\/marketcap.cc\/mobile and helped him open an account. Vivian also told the victim that her aunt is a financial investor who knew the market very well, and would help them buy and sell the crypto currency USDT on that website. Over the course of a few months, the victim had transferred approximately $200,000 to this website. Vivian showed him to check his balance on the website, and he believed his balance was more than a million dollars. At that point, the victim tried to withdraw $50,000 but got a message from the website saying he needed to pay taxes of more than $120,000 first before he could transfer money out of the account. When he didn’t pay they blocked his account and threatened they would close it and keep all of his money. The victim became concerned a reached out to DFPI. The company operated the website at https:\/\/marketcap.cc\/mobile.","Primary Subject":"https:\/\/marketcap.cc\/mobile (This is not to be confused with other companies that use the name \"marketcap\")"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim was contacted by “Lotus Nina Ivanovna” who said she could help with cryptocurrency trading. Victim transferred coins from legitimate crypto brokerages to the scam site: https:\/\/mobile.coinbaseltdus.com\/pc.html. Afterward, victim received a message on the website claiming her account was locked for verification and that she needed to transfer more money to the account to unlock. Victim then realized it was a scam. The company operated a website at https:\/\/mobile.coinbaseltdus.com.","Primary Subject":"https:\/\/mobile.coinbaseltdus.com\/ (Entity impersonating Coinbase-related entity)"},{"Type":"Imposter Scam","Complaint Narrative":"The victim got a text message from a stranger calling herself “Arina” a divorced woman from Singapore living in Irvine, California. The initial contact was a “wrong number” but eventually gained the victim’s trust through repeated texts, and at some point asked to move the conversation to the Telegram app. There, the conversation turned to investing and Arina claimed she was making great profits and offered to help the victim trade because they were friends. Arina then directed the victim to a cryptocurrency trading app. At first, the victim invested $500, and after showing that he had made a huge return on investment, Arina told him to make a test withdrawal to make sure that there were no problems, and he was able to withdraw money. Victim did some research on the company, and after seeing his withdrawal go smoothly, he believed it was a legitimate cryptocurrency exchange. After that Arina encouraged the victim to deposit increasing amounts of money, she even told him to take out personal loans in order to achieve greater profits. Then one evening, the victim was randomly looking for more information on the exchange and came across another victim who described the “pig butchering” scam. The victim immediately tried to withdraw all of his funds, but just like the other victim had warned, he got a message from the website’s “customer service team” saying he needed to pay taxes on the money before they would release the funds. The company operated the website at https:\/\/www.decurretbit.com\/p\/pc. This is not to be confused with the website www.decurretbit.com.","Primary Subject":"https:\/\/www.decurretbit.com\/p\/pc (Entity impersonating Japanese company, Decurret)"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Samantha Yeelina” on a dating app, and they began talking via phone calls and text messages. After some time, Samantha told the victim that she was very good at trading cryptocurrency, and could help him make money, plus it would be a fun way to connect more. The victim started with a $1,000 investment, and was able to withdraw some of the funds, so he added more money. He believed his relationship with Samantha was strong, and she began to talk about love, marriage, and kids. But when the victim asked to meet her in person, she claimed her mom got sick and needed to take care of her at the hospital. At some point, the victim tried to withdraw money from the website, and Samantha contacted him, asking him what he was doing. Samantha then told the victim to invest more, reassuring him the money would be for their future. Then, Samantha told him they needed to make as much profit as possible, and she pressured him to take out a $100,000 loan. At that point, the victim became suspicious that he was involved in a romance scam. The company operated the website at jexwallet.xyz.        ","Primary Subject":"jexwallet.xyz"},{"Type":"Imposter Scam","Complaint Narrative":"The victim met “Samantha Yeelina” on a dating app, and they began talking via phone calls and text messages. After some time, Samantha told the victim that she was very good at trading cryptocurrency, and could help him make money, plus it would be a fun way to connect more. The victim started with a $1,000 investment, and was able to withdraw some of the funds, so he added more money. He believed his relationship with Samantha was strong, and she began to talk about love, marriage, and kids. But when the victim asked to meet her in person, she claimed her mom got sick and needed to take care of her at the hospital. At some point, the victim tried to withdraw money from the website, and Samantha contacted him, asking him what he was doing. Samantha then told the victim to invest more, reassuring him the money would be for their future. Then, Samantha told him they needed to make as much profit as possible, and she pressured him to take out a $100,000 loan. At that point, the victim became suspicious that he was involved in a romance scam. The company operated the website at jexwallet.xyz.        ","Primary Subject":"jexwallet.xyz"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Samantha Yeelina” on a dating app, and they began talking via phone calls and text messages. After some time, Samantha told the victim that she was very good at trading cryptocurrency, and could help him make money, plus it would be a fun way to connect more. The victim started with a $1,000 investment, and was able to withdraw some of the funds, so he added more money. He believed his relationship with Samantha was strong, and she began to talk about love, marriage, and kids. But when the victim asked to meet her in person, she claimed her mom got sick and needed to take care of her at the hospital. At some point, the victim tried to withdraw money from the website, and Samantha contacted him, asking him what he was doing. Samantha then told the victim to invest more, reassuring him the money would be for their future. Then, Samantha told him they needed to make as much profit as possible, and she pressured him to take out a $100,000 loan. At that point, the victim became suspicious that he was involved in a romance scam. The company operated the website at jexwallet.xyz.        ","Primary Subject":"jexwallet.xyz"},{"Type":"Romance Scam","Complaint Narrative":"The victim met “Samantha Yeelina” on a dating app, and they began talking via phone calls and text messages. After some time, Samantha told the victim that she was very good at trading cryptocurrency, and could help him make money, plus it would be a fun way to connect more. The victim started with a $1,000 investment, and was able to withdraw some of the funds, so he added more money. He believed his relationship with Samantha was strong, and she began to talk about love, marriage, and kids. But when the victim asked to meet her in person, she claimed her mom got sick and needed to take care of her at the hospital. At some point, the victim tried to withdraw money from the website, and Samantha contacted him, asking him what he was doing. Samantha then told the victim to invest more, reassuring him the money would be for their future. Then, Samantha told him they needed to make as much profit as possible, and she pressured him to take out a $100,000 loan. At that point, the victim became suspicious that he was involved in a romance scam. The company operated the website at jexwallet.xyz.        ","Primary Subject":"jexwallet.xyz"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met a person who called themselves “Lili Chen” on the communication app Zoosk. After communicating for a while, Lili began talking about investing in crypto. Lili told the victim she wanted them to spend their lives together. Lili had the victim send money to the website, which she claimed was a trading platform, and said he could make large profits. She even showed the victim he could put money back into his account. After a few weeks, she suggested they set up a ‘love fund’ so they could move away together. She instructed him to set up an account and she promised to put $80,000 in it, if he promised to put in $20,000. He did so, but then Lili said she had to take care of her Aunt and needed the victim to contribute $30,000 more before they could meet. The victim put another $20,000 in, and believed that including profits, the account was worth $120,000, but when he tried to take some of his money out, he got a message from the website’s customer service saying he needed to pay 10 % of the total amount of the account before he could get any amount back. The victim became concerned a reached out to DFPI. The company operated the website at sswapep.vip.  ","Primary Subject":"sswapep.vip"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met a person who called themselves “Lili Chen” on the communication app Zoosk. After communicating for a while, Lili began talking about investing in crypto. Lili told the victim she wanted them to spend their lives together. Lili had the victim send money to the website, which she claimed was a trading platform, and said he could make large profits. She even showed the victim he could put money back into his account. After a few weeks, she suggested they set up a ‘love fund’ so they could move away together. She instructed him to set up an account and she promised to put $80,000 in it, if he promised to put in $20,000. He did so, but then Lili said she had to take care of her Aunt and needed the victim to contribute $30,000 more before they could meet. The victim put another $20,000 in, and believed that including profits, the account was worth $120,000, but when he tried to take some of his money out, he got a message from the website’s customer service saying he needed to pay 10 % of the total amount of the account before he could get any amount back. The victim became concerned a reached out to DFPI. The company operated the website at sswapep.vip.  ","Primary Subject":"sswapep.vip"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met “Kathy Lina” on a dating site and they began talking and texting for about a month, during which time she kept showing the victim how much money she was making with a certain crypto investment site. Eventually, the victim deposited money. The victim reported that all communication with the website was through a chatbot help window. He believed he had a balance of more than $16,000, but he tried to withdraw some of the money he was told he had violated company rules. He got a message saying the only way he could withdraw was to deposit an amount equal to what he had in the account, approximately $16,000. At this point he realized it was a scam. The company operated the website at https:\/\/www. tesbtcinge.com.    ","Primary Subject":"tesbtcinge.com"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met “Kathy Lina” on a dating site and they began talking and texting for about a month, during which time she kept showing the victim how much money she was making with a certain crypto investment site. Eventually, the victim deposited money. The victim reported that all communication with the website was through a chatbot help window. He believed he had a balance of more than $16,000, but he tried to withdraw some of the money he was told he had violated company rules. He got a message saying the only way he could withdraw was to deposit an amount equal to what he had in the account, approximately $16,000. At this point he realized it was a scam. The company operated the website at https:\/\/www. tesbtcinge.com.    ","Primary Subject":"tesbtcinge.com"},{"Type":"Romance Scam","Complaint Narrative":"The victim met “Kathy Lina” on a dating site and they began talking and texting for about a month, during which time she kept showing the victim how much money she was making with a certain crypto investment site. Eventually, the victim deposited money. The victim reported that all communication with the website was through a chatbot help window. He believed he had a balance of more than $16,000, but he tried to withdraw some of the money he was told he had violated company rules. He got a message saying the only way he could withdraw was to deposit an amount equal to what he had in the account, approximately $16,000. At this point he realized it was a scam. The company operated the website at https:\/\/www. tesbtcinge.com.    ","Primary Subject":"tesbtcinge.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"The victim met a woman on the online dating app Tinder. She offered to show the victim how to make money spot trading gold. The scammer had the victim open an account on the Meta Trader 5 trading platform and simulate some trades, which showed the victim making money. The scammer also directed the victim to open an account on another platform, trader.bfy-c.co. After the simulated trading, the scammer then directed the victim to trade real funds, and he wired more than $120,000 to the Meta Trader 5 trading platform, which was transferred to the trader.bfy-c.co platform. The platform indicated that the account was worth more than $250,000 but when he tried to withdraw some of the funds, he was told by the platform that he would have to pay taxes of at least $14,000. The victim reports that he has been unable to get any funds back, despite repeated attempts. The company operated the website at https:\/\/trader.bfy-c.co.    ","Primary Subject":"trader.bfy-c.co"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim met a woman on the online dating app Tinder. She offered to show the victim how to make money spot trading gold. The scammer had the victim open an account on the Meta Trader 5 trading platform and simulate some trades, which showed the victim making money. The scammer also directed the victim to open an account on another platform, trader.bfy-c.co. After the simulated trading, the scammer then directed the victim to trade real funds, and he wired more than $120,000 to the Meta Trader 5 trading platform, which was transferred to the trader.bfy-c.co platform. The platform indicated that the account was worth more than $250,000 but when he tried to withdraw some of the funds, he was told by the platform that he would have to pay taxes of at least $14,000. The victim reports that he has been unable to get any funds back, despite repeated attempts. The company operated the website at https:\/\/trader.bfy-c.co.    ","Primary Subject":"trader.bfy-c.co"},{"Type":"Romance Scam","Complaint Narrative":"The victim met a woman on the online dating app Tinder. She offered to show the victim how to make money spot trading gold. The scammer had the victim open an account on the Meta Trader 5 trading platform and simulate some trades, which showed the victim making money. The scammer also directed the victim to open an account on another platform, trader.bfy-c.co. After the simulated trading, the scammer then directed the victim to trade real funds, and he wired more than $120,000 to the Meta Trader 5 trading platform, which was transferred to the trader.bfy-c.co platform. The platform indicated that the account was worth more than $250,000 but when he tried to withdraw some of the funds, he was told by the platform that he would have to pay taxes of at least $14,000. The victim reports that he has been unable to get any funds back, despite repeated attempts. The company operated the website at https:\/\/trader.bfy-c.co.    ","Primary Subject":"trader.bfy-c.co"},{"Type":"Advance Fee Scam","Complaint Narrative":"A California victim was contacted by “Jan Thomson & Brewee Lindasay” through Telegram chat about a cryptocurrency investment. Jan and Brewee promised the victim that a $50,000 investment would earn profits of $100,000 to $200,000. The victim was instructed to purchase crypt assets and send them to website us.gocoinoptions.com. Jan and Brewee provided screenshots showing the victim had indeed made profits, but when they tried to withdraw the money, they were told pay 17% taxes on the profit, plus 5% commissions to Jan and Brewee. The victim has lost all contact with the website, and Jan and Brewee are no longer responding. The website has been taken down.  ","Primary Subject":"us.gocoinoptions.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A California victim was contacted by “Jan Thomson & Brewee Lindasay” through Telegram chat about a cryptocurrency investment. Jan and Brewee promised the victim that a $50,000 investment would earn profits of $100,000 to $200,000. The victim was instructed to purchase crypt assets and send them to website us.gocoinoptions.com. Jan and Brewee provided screenshots showing the victim had indeed made profits, but when they tried to withdraw the money, they were told pay 17% taxes on the profit, plus 5% commissions to Jan and Brewee. The victim has lost all contact with the website, and Jan and Brewee are no longer responding. The website has been taken down.  ","Primary Subject":"us.gocoinoptions.com"},{"Type":"Fraudulent Trading Platform","Complaint Narrative":"A Californian met a person online and reported that he fell victim to a Romance Scam. He was asked to invest in spot gold trading on what turned out to be fake platforms. He lost more than $150,000.    ","Primary Subject":"user.fcrown.info"},{"Type":"Pig Butchering Scam","Complaint Narrative":"A Californian met a person online and reported that he fell victim to a Romance Scam. He was asked to invest in spot gold trading on what turned out to be fake platforms. He lost more than $150,000.    ","Primary Subject":"user.fcrown.info"},{"Type":"Romance Scam","Complaint Narrative":"A Californian met a person online and reported that he fell victim to a Romance Scam. He was asked to invest in spot gold trading on what turned out to be fake platforms. He lost more than $150,000.    ","Primary Subject":"user.fcrown.info"},{"Type":"Pig Butchering Scam","Complaint Narrative":"The victim, with the assistance of family and friends, began investing in cryptocurrency through the website www.cryotocurrencybtx.com. After investing about $99,000 into this account using Coinbase Wallet platform and ImToken wallet platform, the victim believed he had made a profit of more than $350,000. He was initially able to withdraw small amounts, but when he sought a larger withdrawal, he received a message from the website that his withdrawal application was rejected, and his funds were frozen because he owed taxes on his earned profits for the year. He was advised that he must pay almost $30,000 in taxes in order to have funds released and resume trading. The victim paid the funds and was told his account was unfrozen and he could now withdraw funds. But when he tried to withdraw his funds, he received another message that said his account was a security risk and he was suspected of using the platform to maliciously cash out and launder money. The message further indicated that according to the relevant regulations of the relevant regulatory agencies for cryptocurrency transactions and the international anti-money laundering law, he must re-submit his identity certificate to customer service (photos of the front and back of his ID card and a selfie with his ID card in hand), and then pay 25% of the current funds in his account as “a risk hedge to relieve the risk status” of his account. Since the website showed his current account capital was more than $250,000, he was told he needed to pay approximately $62,000 as a risk hedge within two days. At that point, the victim became concerned the website was fraudulent. The company operated the website https:\/\/www.cryptocurrencybtx.com and https:\/\/www.cryptocurrencybitcore.com.","Primary Subject":"www.cryptocurrencybtx.com www.cryptocurrencybitcore.com"}]